{"dictionary": {"definitions": [{"pos": "noun", "definitions": ["An associative array, a data structure where each value is referenced by a particular key, analogous to words and definitions in a dictionary (sense 1).", "A reference work with a list of words from one or more languages, normally ordered alphabetically, explaining each word's meanings (senses), and sometimes also containing information on its etymology, pronunciation, usage, semantic relations, and translations, as well as other data.", "A synchronic dictionary of a standardised language held to only contain words that are properly part of the language.", "Any work that has a list of material organized alphabetically; e.g., biographical dictionary, encyclopedic dictionary."]}, {"pos": "verb", "definitions": ["To look up in a dictionary.", "To compile a dictionary.", "To add to a dictionary."]}], "ipa": "/ˈdɪk.ʃə.nə.ɹi/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/1/1f/En-uk-dictionary.ogg/En-uk-dictionary.ogg.mp3", "translations": ["diccionario"], "difficulty": 1, "categories": ["education", "work", "health"]}, "free": {"definitions": [{"pos": "adj", "definitions": ["Unconstrained of identifiers, not bound.", "Not attached; loose.", "Not imprisoned or enslaved.", "Privileged or individual; proprietary.", "Complimentary.", "Ready; eager; acting without spurring or whipping; spirited.", "Unconstrained.", "Such that any map f from X to the underlying set of an object A in the same category as F induces a map ̄f from F to A which is compatible with f (i.e. such that f=̄f∘i).", "Upholding individual rights.", "Without; not containing (what is specified); exempt; clear; liberated.", "Without obligations.", "Not currently in use; not taken; unoccupied.", "Unobstructed, without blockages.", "Obtainable without any payment.", "Having a set of generators which satisfy no non-trivial relations; equivalently, being the group of reduced words on a set of generators.", "With no or only freedom-preserving limitations on distribution or modification.", "Of a rocket or missile: not under the control of a guidance system after being launched.", "Generous; liberal.", "Unattached or uncombined.", "Clear of offence or crime; guiltless; innocent.", "(of a morpheme) That can be used by itself, unattached to another morpheme.", "In any of various technical senses generic, universal.", "To be enjoyed by anyone freely.", "Invested with a particular freedom or franchise; enjoying certain immunities or privileges; admitted to special rights; followed by of.", "Intended for release, as opposed to a checked version.", "Unconstrained by quantifiers.", "Having a linearly independent set of generators (called a basis).", "Certain or honourable; the opposite of base."]}, {"pos": "adv", "definitions": ["Without needing to pay.", "Freely; willingly."]}, {"pos": "verb", "definitions": ["To make free; set at liberty; release.", "To relinquish (previously allocated memory) to the system.", "To rid of something that confines or oppresses."]}, {"pos": "noun", "definitions": ["Abbreviation of freestyle.", "Abbreviation of free kick.", "A free transfer.", "The usual means of restarting play after a foul is committed, where the non-offending team restarts from where the foul was committed."]}], "ipa": "/fɹiː/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/c/c9/En-uk-free.ogg/En-uk-free.ogg.mp3", "translations": ["libre", "gratis", "librar"], "difficulty": 0, "categories": ["health", "education", "work"]}, "thesaurus": {"definitions": [{"pos": "noun", "definitions": ["A dictionary or encyclopedia.", "A publication that provides synonyms (and sometimes antonyms and other semantic relations) for the words of a given language.", "A hierarchy of subject headings: canonical titles of themes and topics, the titles serving as search keys."]}], "ipa": "/θɪˈsɔːɹəs/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/7/75/LL-Q1860_%28eng%29-Vealhurl-thesaurus.wav/LL-Q1860_%28eng%29-Vealhurl-thesaurus.wav.mp3", "translations": ["diccionario de sinónimos"], "difficulty": 1, "categories": ["education", "social life", "health"]}, "encyclopedia": {"definitions": [{"pos": "noun", "definitions": ["A comprehensive reference work (often spanning several printed volumes) with articles (usually arranged in alphabetical order, or sometimes arranged by category) on a range of subjects, sometimes general, sometimes limited to a particular field.", "Similarly comprehensive works in other formats.", "The circle of arts and sciences; a comprehensive summary of knowledge, or of a branch of knowledge."]}], "ipa": "/ənˌsəɪ.kləˈpi.di.ə/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/d/d1/En-us-encyclopedia.ogg/En-us-encyclopedia.ogg.mp3", "translations": ["enciclopedia"], "difficulty": 2, "categories": ["education", "health", "work"]}, "portmanteau": {"definitions": [{"pos": "noun", "definitions": ["A schoolbag.", "A hook on which to hang clothing.", "A large travelling case usually made of leather, and opening into two equal sections.", "A word formed by putting two words together and thereby their meaning e.g. shrinkflation.", "A portmanteau film."]}, {"pos": "adj", "definitions": ["Made by combining two (or more) words, stories, etc., in the manner of a linguistic portmanteau."]}, {"pos": "verb", "definitions": ["To create a portmanteau word."]}], "ipa": "/pɔːtˈmæn.təʊ/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/f/f2/En-us-portmanteau-1.ogg/En-us-portmanteau-1.ogg.mp3", "translations": ["maleta"], "difficulty": 1, "categories": ["education", "health", "work"]}, "cat": {"definitions": [{"pos": "noun", "definitions": ["A strong tackle used to hoist an anchor to the cathead of a ship.", "A person:", "An enthusiast or player of jazz.", "An animal of the family Felidae:", "The trap in that game.", "A double tripod (for holding a plate, etc.) with six feet, of which three rest on the ground, in whatever position it is placed.", "A sturdy merchant sailing vessel (now only in \"catboat\").", "A prostitute.", "Short for cat-o'-nine-tails.", "The game of trap ball.", "The pointed piece of wood that is struck in the game of tipcat.", "The meat of this animal, eaten as food.", "A vagina or vulva.", "A spiteful or angry woman.", "Any similar animal of the family Felidae, which includes lions, tigers, bobcats, leopards, cougars, cheetahs, caracals, lynxes, and other such non-domesticated species.", "A person (usually male).", "A domesticated species (Felis catus) of feline animal, commonly kept as a house pet.", "An animal of the family Felidae", "A wheeled shelter, used in the Middle Ages as a siege weapon to allow assailants to approach enemy defences.", "A program and command in Unix that reads one or more files and directs their content to the standard output.", "Abbreviation of catamaran.", "Abbreviation of catalytic converter.", "Abbreviation of computed axial tomography. Often used attributively, as in “CAT scan” or “CT scan”.", "Any of a variety of earth-moving machines. (from their manufacturer Caterpillar Inc.)", "A ground vehicle which uses caterpillar tracks, especially tractors, trucks, minibuses, and snow groomers.", "Abbreviation of catapult.", "Abbreviation of category.", "Abbreviation of catfish.", "A street name of the drug methcathinone.", "Abbreviation of caterpillar."]}, {"pos": "verb", "definitions": ["To flog with a cat-o'-nine-tails.", "To gossip in a catty manner.", "To hoist (an anchor) by its ring so that it hangs at the cathead.", "To go wandering at night.", "To vomit.", "To apply the cat command to (one or more files).", "To dump large amounts of data on (an unprepared target), usually with no intention of browsing it carefully."]}, {"pos": "adj", "definitions": ["Catastrophic; terrible, disastrous."]}], "ipa": "/kæt/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/1/1e/En-uk-a_cat.ogg/En-uk-a_cat.ogg.mp3", "translations": ["gato"], "difficulty": 0, "categories": ["work", "education", "health"]}, "word": {"definitions": [{"pos": "noun", "definitions": ["News; tidings.", "The smallest discrete unit of spoken language with a particular meaning, composed of one or more phonemes and one or more morphemes", "A watchword or rallying cry, a verbal signal (even when consisting of multiple words).", "Logos, Christ.", "A promise; an oath or guarantee.", "A group element, expressed as a product of group elements.", "A fixed-size group of bits handled as a unit by a machine and which can be stored in or retrieved from a typical register (so that it has the same size as such a register).", "An order; a request or instruction; an expression of will.", "A unit of text equivalent to five characters and one space.", "A minor reprimand.", "The smallest unit of language that has a particular meaning and can be expressed by itself; the smallest discrete, meaningful unit of language. (contrast morpheme.)", "A finite string that is not a command or operator.", "Something that someone said; a comment, utterance; speech.", "The fact or act of speaking, as opposed to taking action. .", "Communication from God; the message of the Christian gospel; the Bible, Scripture.", "Something like such a unit of language:", "The smallest discrete unit of written language with a particular meaning, composed of one or more letters or symbols and one or more morphemes", "A sequence of letters, characters, or sounds, considered as a discrete entity, though it does not necessarily belong to a language or have a meaning.", "See words.", "A brief discussion or conversation.", "A discrete, meaningful unit of language approved by an authority or native speaker (compare non-word).", "A proverb or motto."]}, {"pos": "verb", "definitions": ["To speak, to use words; to converse, to discourse.", "To conjure with a word.", "To flatter with words, to cajole.", "To ply or overpower with words.", "To say or write (something) using particular words; to phrase (something).", "Alternative form of worth (“to become”)."]}, {"pos": "intj", "definitions": ["Truth, indeed, that is the truth! The shortened form of the statement \"My word is my bond.\"", "An abbreviated form of word up; a statement of the acknowledgment of fact with a hint of nonchalant approval."]}], "ipa": "/wɜːd/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/b/bf/En-us-word.ogg/En-us-word.ogg.mp3", "translations": ["palabra", "redactar"], "difficulty": 0, "categories": ["education", "social life", "work"]}, "book": {"definitions": [{"pos": "noun", "definitions": ["A major division of a long work.", "A portfolio of one's previous work in the industry.", "A convenient collection, in a form resembling a book, of small paper items for individual use.", "A document, held by the referee, of the incidents that happened in a game.", "Records of the accounts of a business.", "A record of betting (from the use of a notebook to record what each person has bet).", "A book award, a recognition for receiving the highest grade in a class (traditionally an actual book, but recently more likely a letter or certificate acknowledging the achievement).", "A list of all players who have been booked (received a warning) in a game.", "Any source of instruction.", "The script of a musical or opera.", "The accumulated body of knowledge passed down among black pimps.", "A collection of sheets of paper bound together to hinge at one edge, containing printed or written material, pictures, etc.", "A bookmaker (a person who takes bets on sporting events and similar); bookie; turf accountant.", "Four of a kind.", "The list of mares that a stallion will breed in a given season.", "The twenty-sixth Lenormand card.", "Six tricks taken by one side.", "A list of the races that a jockey is scheduled to ride in.", "The sum of chess knowledge in the opening or endgame.", "A long work fit for publication, typically prose, such as a novel or textbook, and typically published as such a bound collection of sheets, but now sometimes electronically as an e-book."]}, {"pos": "verb", "definitions": ["To receive the highest grade in a class.", "To leave.", "To write down, to register or record in a book or as in a book.", "To record bets as bookmaker.", "To reserve (something) for future use.", "To record the name and other details of a suspected offender and the offence for later judicial action.", "To add a name to the list of people who are participating in something.", "To issue a caution to, usually a yellow card, or a red card if a yellow card has already been issued.", "To travel very fast.", "simple past of bake"]}], "ipa": "/bʊk/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/7/70/En-uk-book.ogg/En-uk-book.ogg.mp3", "translations": ["libro", "reservar"], "difficulty": 0, "categories": ["education", "work", "social life"]}, "pound": {"definitions": [{"pos": "noun", "definitions": ["A unit of mass equal to 12 troy ounces (≈ 373.242 g). Today, this is a common unit of mass when measuring precious metals, and is little used elsewhere.", "A unit of force in various measurement systems", "A unit of mass equal to 16 avoirdupois ounces (= 453.592 g). Today this value is the most common meaning of \"pound\" as a unit of weight.", "Various non-English units of measure.", "Ellipsis of pound force.", "A unit of currency in various currency systems.", "The unit of currency used in the United Kingdom and its dependencies. It is divided into 100 pence. Symbol £.", "The symbol #.", "A unit of weight in various measurement systems.", "Any of various units of currency used in Egypt, Lebanon, Sudan and Syria, and formerly in the Republic of Ireland, Cyprus, Israel and South Africa.", "Various non-English units of currency.", "A unit of mass in various measurement systems.", "Short for pound-force.", "Any of various units of currency formerly used in the United States.", "Ellipsis of pound mass.", "Ellipsis of pound weight.", "A kind of fishing net, having a large enclosure with a narrow entrance into which fish are directed by wings spreading outward.", "A section of a canal between two adjacent locks.", "The people who work for the pound.", "A place for the detention of stray or wandering animals.", "A place for the detention of automobiles that have been illegally parked, abandoned, etc.", "A division inside a fishing stage where cod is cured in salt brine.", "A hard blow."]}, {"pos": "verb", "definitions": ["To wager a pound on.", "To confine in, or as in, a pound; to impound.", "To beat strongly or throb.", "To strike hard, usually repeatedly.", "To advance heavily with measured steps.", "To pitch consistently to a certain location.", "To eat or drink very quickly.", "To crush to pieces; to pulverize.", "To make a jarring noise, as when running.", "To penetrate sexually, with vigour."]}], "ipa": "/paʊnd/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/5/58/En-us-pound.ogg/En-us-pound.ogg.mp3", "translations": ["libra", "perrera", "pilar"], "difficulty": 0, "categories": ["work", "education", "travel"]}, "GDP": {"definitions": [{"pos": "noun", "definitions": ["Initialism of guanosine diphosphate, a nucleotide.", "Initialism of gross domestic product."]}], "ipa": "/ˌd͡ʒiːdiːˈpiː/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/8/86/En-us-GDP.ogg/En-us-GDP.ogg.mp3", "translations": ["PIB"], "difficulty": 0, "categories": ["education", "work", "health"]}, "pond": {"definitions": [{"pos": "noun", "definitions": ["Chiefly in across the pond: the Atlantic Ocean.", "An inland body of standing water, either natural or man-made, that is smaller than a lake.", "An inland body of standing water of any size that is fed by springs rather than by a river."]}, {"pos": "verb", "definitions": ["To block the flow of water so that it can escape only through evaporation or seepage; to dam.", "To form a pond; to pool.", "To make into a pond; to collect, as water, in a pond by damming.", "To ponder."]}], "ipa": "/pɒnd/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/3/38/En-us-pond.ogg/En-us-pond.ogg.mp3", "translations": ["charca"], "difficulty": 0, "categories": ["health", "education", "work"]}, "nonsense": {"definitions": [{"pos": "noun", "definitions": ["An untrue statement.", "Letters or words, in writing or speech, that have no meaning or pattern or seem to have no meaning.", "That which is silly, illogical and lacks any meaning, reason or value; that which does not make sense.", "A type of poetry that contains strange or surreal ideas, as, for example, that written by Edward Lear.", "Something foolish.", "A damaged DNA sequence whose products are not biologically active, that is, that does nothing."]}, {"pos": "verb", "definitions": ["To joke around, to waste time", "To make nonsense of;", "To attempt to dismiss as nonsense; to ignore or belittle the significance of something; to render unimportant or puny."]}, {"pos": "adj", "definitions": ["Nonsensical.", "Resulting from the substitution of a nucleotide in a sense codon, causing it to become a stop codon (not coding for an amino-acid)."]}, {"pos": "intj", "definitions": ["An emphatic rejection of something one has just heard and does not believe or agree with."]}], "ipa": "/ˈnɒn.səns/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/8/86/En-us-nonsense.ogg/En-us-nonsense.ogg.mp3", "translations": ["tontería", "sin sentido"], "difficulty": 1, "categories": ["education", "social life", "work"]}, "pie": {"definitions": [{"pos": "noun", "definitions": ["Any of various other, non-pastry dishes that maintain the general concept of a shell with a filling.", "A kilogram of drugs, especially cocaine.", "The whole of a wealth or resource, to be divided in parts.", "Something very easy; a piece of cake.", "A pie chart.", "A paper plate covered in cream, shaving foam or custard that is thrown or rubbed in someone’s face for comical purposes, to raise money for charity, or as a form of political protest; a custard pie; a cream pie.", "A pizza.", "A type of pastry that consists of an outer crust and a filling. (Savory pies are more popular in the UK and sweet pies are more popular in the US, so \"pie\" without qualification has different connotations in these dialects.)", "The vulva.", "An especially badly bowled ball.", "Magpie.", "A former low-denomination coin of northern India.", "Ellipsis of pie-dog: an Indian breed, a stray dog in Indian contexts.", "A traditional Spanish unit of length, equivalent to about 27.9 cm.", "Alternative form of pi (“metal type that has been spilled, mixed together, or disordered”)"]}, {"pos": "verb", "definitions": ["To hit in the face with a pie, either for comic effect or as a means of protest (see also pieing).", "To go around (a corner) in a guarded manner.", "To ignore (someone).", "Alternative form of pi (“to spill or mix printing type”)"]}], "ipa": "/paɪ/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/6/61/En-us-pie.ogg/En-us-pie.ogg.mp3", "translations": ["pastel"], "difficulty": 0, "categories": ["education", "work", "social life"]}, "crow": {"definitions": [{"pos": "noun", "definitions": ["The emblem of an eagle, a sign of military rank.", "A bar of iron with a beak, crook or claw; a bar of iron used as a lever; a crowbar.", "An ill-tempered and obstinate woman, or one who otherwise has features resembling the bird; a harpy.", "A gangplank (corvus) used by the Ancient Roman navy to board enemy ships.", "Someone who keeps watch while their associates commit a crime; a lookout.", "A bird, usually black, of the genus Corvus, having a strong conical beak, with projecting bristles; it has a harsh, croaking call.", "A black person.", "Any of various dark-coloured nymphalid butterflies of the genus Euploea.", "The mesentery of an animal.", "The cry or call of a rooster or a cockerel, especially as heard at sunrise.", "Alternative spelling of cro (“marijuana”)"]}, {"pos": "adj", "definitions": ["Dark black, the color of a crow; crow-black."]}, {"pos": "verb", "definitions": ["To test the reed of a double reed instrument by placing the reed alone in the mouth and blowing it.", "To make the shrill sound characteristic of a rooster; to make a sound in this manner, either in gaiety, joy, pleasure, or defiance.", "To shout in exultation or defiance; to brag."]}], "ipa": "/kɹəʊ/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/6/6a/En-us-crow.ogg/En-us-crow.ogg.mp3", "translations": ["corneja", "cacarear"], "difficulty": 0, "categories": ["education", "health", "work"]}, "raven": {"definitions": [{"pos": "noun", "definitions": ["Any of several, generally large and lustrous black species of birds in the genus Corvus, especially the common raven (Corvus corax).", "A jet-black color.", "Rapine; rapacity.", "Prey; plunder; food obtained by violence."]}, {"pos": "adj", "definitions": ["Of the color of the raven; jet-black."]}, {"pos": "verb", "definitions": ["To prey on with rapacity.", "To obtain or seize by violence.", "To devour with great eagerness.", "To show rapacity; to be greedy (for something)."]}], "ipa": "/ˈɹeɪvən/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/2/2f/En-us-raven.ogg/En-us-raven.ogg.mp3", "translations": ["cuervo"], "difficulty": 0, "categories": ["health", "education", "work"]}, "elephant": {"definitions": [{"pos": "noun", "definitions": ["Ivory.", "Anything huge and ponderous.", "used when counting to add length, so that each count takes about one second", "Any member of the subfamily Elephantinae not also of the genera Mammuthus and Primelephas.", "A xiangqi piece that is moved two points diagonally, may not jump over intervening pieces and may not cross the river.", "Synonym of elephant paper", "A mammal of the order Proboscidea, having a trunk, and two large ivory tusks jutting from the upper jaw."]}], "ipa": "/ˈɛlɪf(ə)nt/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/f/f2/En-us-elephant.ogg/En-us-elephant.ogg.mp3", "translations": ["elefante"], "difficulty": 1, "categories": ["health", "travel", "education"]}, "brown": {"definitions": [{"pos": "noun", "definitions": ["Black tar heroin.", "Any of various nymphalid butterflies of subfamily Satyrinae (formerly the family Satyridae).", "A mass of birds or animals that may be indiscriminately fired at.", "One of the colour balls used in snooker, with a value of 4 points.", "A copper coin.", "A colour like that of chocolate or coffee.", "A brown horse or other animal.", "Any of certain species of nymphalid butterflies of subfamily Satyrinae, such as those of the genera Heteronympha and Melanitis.", "A brown trout (Salmo trutta).", "A person of Latino, Middle Eastern or South Asian descent; a brown-skinned person; someone of mulatto, or biracial appearance."]}, {"pos": "adj", "definitions": ["Of or relating to any of various ethnic groups having dark pigmentation of the skin.", "Having a brown colour.", "Latino", "Southeast Asian", "Gloomy.", "of color.", "Not green: not environmentally responsible.", "South Asian or sometimes Middle Eastern or North African"]}, {"pos": "verb", "definitions": ["To make brown or dusky.", "To tan.", "To cook something until it becomes brown.", "To turn progressively more Hispanic or Latino, in the context of the population of a geographic region.", "To give a bright brown colour to, as to gun barrels, by forming a thin coating of oxide on their surface.", "To become brown."]}], "ipa": "/bɹaʊn/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/2/29/En-us-brown.ogg/En-us-brown.ogg.mp3", "translations": ["marrón", "marrón", "pardear"], "difficulty": 0, "categories": ["health", "education", "travel"]}, "December": {"definitions": [{"pos": "name", "definitions": ["A surname.", "The twelfth and last month of the Gregorian calendar, following November and preceding the January of the following year, containing the southern solstice.", "A female given name transferred from the month name [in turn from English]."]}], "ipa": "/dɪˈsɛmbə/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/9/92/En-us-December.ogg/En-us-December.ogg.mp3", "translations": ["diciembre"], "difficulty": 1, "categories": ["education", "health", "work"]}, "month": {"definitions": [{"pos": "noun", "definitions": ["A woman's period; menstrual discharge.", "A period of 30 days, 31 days, or some alternation thereof.", "A period into which a year is divided, historically based on the phases of the moon."]}], "ipa": "/mʌnθ/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/b/b6/En-uk-a_month.ogg/En-uk-a_month.ogg.mp3", "translations": ["mes"], "difficulty": 0, "categories": ["education", "health", "work"]}, "January": {"definitions": [{"pos": "name", "definitions": ["The first month of the Gregorian calendar, following the December of the previous year and preceding February. Abbreviation: Jan or Jan.", "A female given name transferred from the month name [in turn from English]."]}], "ipa": "/ˈd͡ʒæn.j(ʊ.)ə.ɹi/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/8/8c/En-us-January.ogg/En-us-January.ogg.mp3", "translations": ["enero"], "difficulty": 1, "categories": ["education", "health", "work"]}, "February": {"definitions": [{"pos": "name", "definitions": ["The short month following January and preceding March in the Roman, Julian, and Gregorian calendars, used in all three calendars for intercalation or addition of leap days.", "A female given name transferred from the month name [in turn from English]."]}], "ipa": "/ˈfɛb.ɹʊ.ə.ɹi/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/1/18/En-uk-february.ogg/En-uk-february.ogg.mp3", "translations": ["febrero"], "difficulty": 1, "categories": ["education", "health", "travel"]}, "march": {"definitions": [{"pos": "noun", "definitions": ["Steady forward movement or progression.", "A political rally or parade.", "The feat of taking all the tricks of a hand.", "Any song in the genre of music written for marching (see Wikipedia's article on this type of music)", "A formal, rhythmic way of walking, used especially by soldiers, by bands, and in ceremonies.", "A journey so walked.", "A border region, especially one originally set up to defend a boundary.", "A region at a frontier governed by a marquess.", "Any of various territories with similar meanings or etymologies in their native languages.", "Smallage."]}, {"pos": "verb", "definitions": ["To cause someone to walk somewhere.", "To walk with long, regular strides, as a soldier does.", "To make steady progress.", "To go to war; to make military advances.", "To have common borders or frontiers"]}], "ipa": "/mɑːtʃ/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/6/6a/En-us-March.ogg/En-us-March.ogg.mp3", "translations": ["marcha", "marchar", "marca"], "difficulty": 0, "categories": ["education", "health", "work"]}, "April": {"definitions": [{"pos": "name", "definitions": ["The fourth month of the Gregorian calendar, following March and preceding May. Abbreviation: Apr or Apr.", "A surname.", "A female given name transferred from the month name [in turn from English]; used since the early 20th century."]}], "ipa": "/ˈeɪ.pɹɪl/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/3/35/En-us-April.ogg/En-us-April.ogg.mp3", "translations": ["abril"], "difficulty": 0, "categories": ["education", "social life", "health"]}, "may": {"definitions": [{"pos": "verb", "definitions": ["Granting the admissibility of a supposition, in a way that can be semantically either subjunctive or indicative.", "To be strong; to have power (over).", "Used in modesty, courtesy, or concession, or to soften a question or remark.", "To have permission to, be allowed. Used in granting permission and in questions to make polite requests.", "To be able; can.", "Expressing a disjunctive or contrastive relation between indicative statements.", "To be able to go.", "Expressing a wish (with present subjunctive effect).", "Expressing a present possibility; possibly.", "To celebrate May Day.", "To gather may, or flowers in general."]}, {"pos": "noun", "definitions": ["The hawthorn bush or its blossoms.", "A maiden."]}], "ipa": "/meɪ/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/5/54/En-us-May.ogg/En-us-May.ogg.mp3", "translations": ["poder", "espino"], "difficulty": 0, "categories": ["travel", "education", "social life"]}, "June": {"definitions": [{"pos": "name", "definitions": ["A female given name transferred from the month name [in turn from English], for a girl born in June, used since the end of the 19th century.", "The sixth month of the Gregorian calendar, following May and preceding July. Abbreviation: Jun or Jun.", "A male given name, or more often nickname, for a boy who is junior to someone else, especially someone with the same name, such as his father."]}], "ipa": "/d͡ʒuːn/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/9/97/En-us-June.ogg/En-us-June.ogg.mp3", "translations": ["junio"], "difficulty": 0, "categories": ["health", "education", "social life"]}, "July": {"definitions": [{"pos": "name", "definitions": ["A female given name from English.", "The seventh month of the Gregorian calendar, following June and preceding August. Abbreviation: Jul or Jul.", "A surname from French."]}], "ipa": "/d͡ʒʊˈlaɪ/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/a/a1/En-us-July.ogg/En-us-July.ogg.mp3", "translations": ["julio"], "difficulty": 0, "categories": ["health", "education", "work"]}, "august": {"definitions": [{"pos": "adj", "definitions": ["Of noble birth.", "Awe-inspiring, majestic, noble, venerable."]}, {"pos": "verb", "definitions": ["To make ripe; ripen.", "To bring to realization."]}, {"pos": "noun", "definitions": ["Alternative form of auguste (“kind of clown”)"]}], "ipa": "/ɔːˈɡʌst/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/4/48/En-us-august.ogg/En-us-august.ogg.mp3", "translations": ["majestuoso"], "difficulty": 0, "categories": ["education", "travel", "health"]}, "September": {"definitions": [{"pos": "name", "definitions": ["The ninth month of the Gregorian calendar, following August and preceding October. Abbreviations: Sep or Sep., Sept or Sept.", "A female or male given name transferred from the month name [in turn from English]."]}], "ipa": "/sɛpˈtɛmbə/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/5/5b/En-us-September.ogg/En-us-September.ogg.mp3", "translations": ["septiembre"], "difficulty": 1, "categories": ["education", "travel", "health"]}, "October": {"definitions": [{"pos": "name", "definitions": ["A female given name transferred from the month name.", "The tenth month of the Gregorian calendar, following September and preceding November. Abbreviation: Oct."]}, {"pos": "noun", "definitions": ["A type of ale traditionally brewed in October."]}, {"pos": "verb", "definitions": ["In the early Soviet Union, to give a child a name tinged with Soviet revolutionary thought, as opposed to religious christening."]}], "ipa": "/ɒkˈtəʊ.bə/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/2/26/En-us-October.ogg/En-us-October.ogg.mp3", "translations": ["octubre"], "difficulty": 0, "categories": ["education", "travel", "social life"]}, "November": {"definitions": [{"pos": "name", "definitions": ["A female given name.", "The eleventh month of the Gregorian calendar, following October and preceding December. Abbreviation: Nov or Nov."]}], "ipa": "/nəʊˈvɛmbə/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/4/4f/En-us-November.ogg/En-us-November.ogg.mp3", "translations": ["noviembre"], "difficulty": 1, "categories": ["education", "health", "social life"]}, "multiculturalism": {"definitions": [{"pos": "noun", "definitions": ["The characteristics of an organization, society, city etc. which has many different ethnic or national cultures mingling freely; political or social policies which support or encourage such coexistence.", "the cultural Marxism conspiracy theory."]}], "ipa": "/ˌmʌltɪˈkʌltʃəɹəˌlɪz(ə)m/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/e/ec/En-au-multiculturalism.ogg/En-au-multiculturalism.ogg.mp3", "translations": ["multiculturalismo"], "difficulty": 2, "categories": ["work", "education", "social life"]}, "day": {"definitions": [{"pos": "noun", "definitions": ["The time when the Sun is above the horizon and it lights the sky.", "The time taken for the Earth to make a full rotation about its axis with respect to the fixed stars; a sidereal day or stellar day.", "The time taken for the Sun to seem to be in the same place in the sky twice; a solar day.", "A period of time between two set times which mark the beginning and the end of day in a calendar, such as from midnight to the following midnight or (Judaism) from nightfall to the following nightfall.", "The part of a day period which one spends at one’s job, school, etc.", "A period of time equal or almost equal to a full day-night cycle.", "A period of contention of a day or less.", "The rotational period of a planet.", "An observance lasting for a day, such as an annual holiday.", "A 24-hour period beginning at 6am or sunrise.", "A specified time or period; time, considered with reference to the existence or prominence of a person or thing; age; time; era."]}, {"pos": "verb", "definitions": ["To spend a day (in a place)."]}], "ipa": "/deɪ/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/3/31/En-uk-a_day.ogg/En-uk-a_day.ogg.mp3", "translations": ["día"], "difficulty": 0, "categories": ["work", "education", "daily life"]}, "Monday": {"definitions": [{"pos": "noun", "definitions": ["The second day of the week in many religious traditions, and the first day of the week in systems using the ISO 8601 norm. It follows Sunday and precedes Tuesday."]}, {"pos": "adv", "definitions": ["On Monday."]}], "ipa": "/ˈmʌn.deɪ/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/6/63/En-us-Monday.ogg/En-us-Monday.ogg.mp3", "translations": ["lunes"], "difficulty": 0, "categories": ["education", "health", "social life"]}, "Tuesday": {"definitions": [{"pos": "noun", "definitions": ["The third day of the week in many religious traditions, and the second day of the week in systems that use the ISO 8601 norm; it follows Monday and precedes Wednesday.", "An ordinary, unmemorable day."]}, {"pos": "adv", "definitions": ["On Tuesday."]}], "ipa": "/ˈtjuːzdeɪ/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/d/dc/En-us-Tuesday.ogg/En-us-Tuesday.ogg.mp3", "translations": ["martes", "martes"], "difficulty": 0, "categories": ["health", "education", "daily life"]}, "Wednesday": {"definitions": [{"pos": "noun", "definitions": ["The fourth day of the week in many religious traditions, and the third day of the week in systems using the ISO 8601 norm; it follows Tuesday and precedes Thursday."]}, {"pos": "name", "definitions": ["nickname of Sheffield Wednesday of the Football League."]}, {"pos": "adv", "definitions": ["On Wednesday."]}], "ipa": "/ˈwɛnzdeɪ/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/d/d3/En-uk-Wednesday.ogg/En-uk-Wednesday.ogg.mp3", "translations": ["miércoles"], "difficulty": 1, "categories": ["health", "education", "social life"]}, "Thursday": {"definitions": [{"pos": "noun", "definitions": ["The fifth day of the week in many religious traditions, and the fourth day of the week in systems using the ISO 8601 norm; it follows Wednesday and precedes Friday."]}, {"pos": "adv", "definitions": ["On Thursday."]}], "ipa": "/ˈθɜːzdeɪ/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/e/ed/En-uk-Thursday.ogg/En-uk-Thursday.ogg.mp3", "translations": ["jueves", "el jueves"], "difficulty": 0, "categories": ["education", "health", "social life"]}, "Friday": {"definitions": [{"pos": "noun", "definitions": ["The sixth day of the week in many religious traditions, and the fifth day of the week in systems using the ISO 8601 norm; the Muslim Sabbath; it follows Thursday and precedes Saturday.", "The last workday in a work schedule that is not Monday through Friday."]}, {"pos": "adv", "definitions": ["On Friday."]}], "ipa": "/ˈfɹaɪdeɪ/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/2/22/En-uk-Friday.ogg/En-uk-Friday.ogg.mp3", "translations": ["viernes", "el viernes"], "difficulty": 0, "categories": ["work", "health", "education"]}, "Saturday": {"definitions": [{"pos": "noun", "definitions": ["The seventh day of the week in many religious traditions, and the sixth day of the week in systems using the ISO 8601 norm; the Jewish Sabbath; it follows Friday and precedes Sunday."]}, {"pos": "adv", "definitions": ["On Saturday."]}, {"pos": "verb", "definitions": ["To spend Saturday (at a place or doing an activity)."]}], "ipa": "/ˈsætədeɪ/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/9/9c/En-uk-Saturday.ogg/En-uk-Saturday.ogg.mp3", "translations": ["sábado"], "difficulty": 0, "categories": ["health", "education", "travel"]}, "Sunday": {"definitions": [{"pos": "noun", "definitions": ["A comic strip published in a Sunday newspaper.", "A newspaper published on Sunday.", "Describes someone who does something occasionally or casually, and therefore without skill.", "The first day of the week in many religious traditions, and the seventh day of the week in systems using the ISO 8601 standard; the Christian Sabbath; the Lord's Day; it follows Saturday and precedes Monday."]}, {"pos": "verb", "definitions": ["To spend Sunday (at a certain place, with a certain person or people, etc.)."]}, {"pos": "adv", "definitions": ["On Sunday."]}], "ipa": "/ˈsʌn.deɪ/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/3/3e/En-us-Sunday.ogg/En-us-Sunday.ogg.mp3", "translations": ["domingo"], "difficulty": 0, "categories": ["social life", "work", "education"]}, "lexicography": {"definitions": [{"pos": "noun", "definitions": ["The art or craft of compiling, writing, and editing dictionaries.", "A dictionary, a lexicon, a wordbook.", "The scholarly discipline of analysing and describing the semantic, syntagmatic and paradigmatic relationships within the lexicon (vocabulary) of a language and developing theories of dictionary components and structures linking the data in dictionaries."]}], "ipa": "/ˌlɛksɪˈkɒɡɹəfi/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/2/21/LL-Q1860_%28eng%29-Vealhurl-lexicography.wav/LL-Q1860_%28eng%29-Vealhurl-lexicography.wav.mp3", "translations": ["lexicografía"], "difficulty": 2, "categories": ["education", "work", "social life"]}, "antonym": {"definitions": [{"pos": "noun", "definitions": ["A word that describes one end of a scale, while its opposite describes the other end, such as large versus small; a gradable antonym.", "A word which has the opposite meaning of another word."]}], "ipa": "/ˈæn.təˌnɪm/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/3/34/En-us-antonym.ogg/En-us-antonym.ogg.mp3", "translations": ["antónimo"], "difficulty": 1, "categories": ["education", "work", "health"]}, "connotation": {"definitions": [{"pos": "noun", "definitions": ["The attribute or aggregate of attributes connoted by a term, contrasted with denotation.", "A meaning of a word or phrase that is suggested or implied, as opposed to a denotation, or literal meaning. A characteristic of words or phrases, or of the contexts that words and phrases are used in."]}], "ipa": "/ˌkɑnəˈteɪʃən/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/6/62/LL-Q1860_%28eng%29-Vealhurl-connotation.wav/LL-Q1860_%28eng%29-Vealhurl-connotation.wav.mp3", "translations": ["connotación"], "difficulty": 1, "categories": ["education", "work", "social life"]}, "denotation": {"definitions": [{"pos": "noun", "definitions": ["The primary, surface, literal, or explicit meaning of a signifier such as a word, phrase, or symbol; that which a word denotes, as contrasted with its connotation; the aggregate or set of objects of which a word may be predicated.", "Something signified or referred to; a particular meaning of a symbol", "The act of denoting, or something (such as a symbol) that denotes", "Any mathematical object which describes the meanings of expressions from the languages, formalized in the theory of denotational semantics", "The intension and extension of a word", "A first level of analysis: what the audience can visually see on a page. Denotation often refers to something literal, and avoids being a metaphor."]}], "ipa": "/ˌdiː.noʊˈteɪ.ʃən/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/4/47/En-us-denotation.ogg/En-us-denotation.ogg.mp3", "translations": ["denotación"], "difficulty": 2, "categories": ["education", "work", "social life"]}, "synonym": {"definitions": [{"pos": "noun", "definitions": ["A word or phrase with a meaning that is the same as, or very similar to, another word or phrase.", "Any name that has been applied to a taxon other than the one to be used, including those not allowed by the rules such as misspellings or nomina nuda.", "The subset of those names other than the one to be used according to the rules.", "An alternative (often shorter) name defined for an object in a database.", "Any of the various names that could in theory be used for a taxon in accordance with the relevant rules.", "A word or term whose meaning is the same as that of another."]}], "ipa": "/ˈsɪn.əˌnɪm/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/5/52/En-us-synonym.ogg/En-us-synonym.ogg.mp3", "translations": ["sinónimo"], "difficulty": 1, "categories": ["education", "work", "social life"]}, "dialect": {"definitions": [{"pos": "noun", "definitions": ["A variant of a non-standardized programming language.", "A language existing only in an oral or non-standardized form, especially a language spoken in a developing country or an isolated region.", "A lect (often a regional or minority language) as part of a group or family of languages, especially if they are viewed as a single language, or if contrasted with a standardized idiom that is considered the 'true' form of the language (for example, Bavarian as contrasted with Standard German).", "Language that is perceived as substandard or wrong.", "A variant form of the vocalizations of a bird species restricted to a certain area or population.", "A variety of a language that is characteristic of a particular area, community, or social group, differing from other varieties of the same language in relatively minor ways as regards grammar, phonology, and lexicon."]}], "ipa": "/ˈdaɪ.əˌlɛkt/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/5/5f/En-us-dialect.ogg/En-us-dialect.ogg.mp3", "translations": ["dialecto"], "difficulty": 0, "categories": ["education", "health", "work"]}, "hyponym": {"definitions": [{"pos": "noun", "definitions": ["A more specific term; a subordinate grouping word or phrase; a term designating a subclass of another more general class described by the given word."]}], "ipa": "/ˈhaɪpəʊ.nɪm/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/0/03/En-ca-hyponym.ogg/En-ca-hyponym.ogg.mp3", "translations": ["hipónimo"], "difficulty": 1, "categories": ["education", "work", "social life"]}, "semantics": {"definitions": [{"pos": "noun", "definitions": ["The meaning of computer language constructs, in contrast to their form or syntax.", "The individual meanings of words, as opposed to the overall meaning of a passage.", "A branch of linguistics studying the meaning of words.", "Pettiness or triviality.", "The study of the relationship between words and their meanings."]}], "ipa": "/sɪˈmæntɪks/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/e/eb/LL-Q1860_%28eng%29-Vealhurl-semantics.wav/LL-Q1860_%28eng%29-Vealhurl-semantics.wav.mp3", "translations": ["semántica"], "difficulty": 1, "categories": ["education", "work", "health"]}, "false friend": {"definitions": [{"pos": "noun", "definitions": ["A word in a language that bears a deceptive resemblance to a word in another language but in fact has a different meaning.", "Used other than figuratively or idiomatically: see false, friend."]}], "ipa": "/ˌfɒls ˈfɹɛnd/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/1/1c/En-us-false_friend.ogg/En-us-false_friend.ogg.mp3", "translations": ["falso amigo"], "difficulty": 1, "categories": ["education", "work", "social life"]}, "noun": {"definitions": [{"pos": "noun", "definitions": ["A word that functions as the name of a specific object or set of objects, such as person, animal, place, word, thing, phenomenon, substance, quality, or idea: one of the basic parts of speech in many languages, including English.", "An object within a user interface to which a certain action or transformation (i.e., verb) is applied.", "Either a word that can be used to refer to a person, animal, place, thing, phenomenon, substance, quality or idea, or a word that modifies or describes a previous word or its referent; a substantive or adjective, sometimes also including other parts of speech such as numeral or pronoun."]}, {"pos": "verb", "definitions": ["To convert a word to a noun."]}], "ipa": "/naʊn/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/e/ed/En-us-inlandnorth-noun.ogg/En-us-inlandnorth-noun.ogg.mp3", "translations": ["sustantivo"], "difficulty": 0, "categories": ["education", "social life", "work"]}, "hour": {"definitions": [{"pos": "noun", "definitions": ["A season, moment, or time.", "A unit of time of one twenty-fourth of a day (sixty minutes).", "The set times of prayer, the canonical hours, the offices or services prescribed for these, or a book containing them.", "A distance that can be traveled in one hour.", "Used after a two-digit hour and a two-digit minute to indicate time.", "The time.", "The amount of labor demanded by an employer in terms of time."]}], "ipa": "/aʊə/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/1/18/En-uk-an_hour.ogg/En-uk-an_hour.ogg.mp3", "translations": ["hora"], "difficulty": 0, "categories": ["work", "education", "health"]}}
