[{"word": "dictionary", "definitions": [{"pos": "noun", "definitions": ["A reference work with a list of words from one or more languages, normally ordered alphabetically, explaining each word's meanings (senses), and sometimes also containing information on its etymology, pronunciation, usage, semantic relations, and translations, as well as other data.", "An associative array, a data structure where each value is referenced by a particular key, analogous to words and definitions in a dictionary (sense 1).", "A synchronic dictionary of a standardised language held to only contain words that are properly part of the language.", "Any work that has a list of material organized alphabetically; e.g., biographical dictionary, encyclopedic dictionary."]}, {"pos": "verb", "definitions": ["To add to a dictionary.", "To compile a dictionary.", "To look up in a dictionary."]}], "ipa": "/ˈdɪk.ʃə.nə.ɹi/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/1/1f/En-uk-dictionary.ogg/En-uk-dictionary.ogg.mp3", "translations": ["diccionario"], "difficulty": 1, "categories": ["education", "work", "travel"], "syllable_count": 4}, {"word": "free", "definitions": [{"pos": "adj", "definitions": ["Of a rocket or missile: not under the control of a guidance system after being launched.", "Without; not containing (what is specified); exempt; clear; liberated.", "Having a linearly independent set of generators (called a basis).", "(of a morpheme) That can be used by itself, unattached to another morpheme.", "Not imprisoned or enslaved.", "With no or only freedom-preserving limitations on distribution or modification.", "Certain or honourable; the opposite of base.", "Obtainable without any payment.", "To be enjoyed by anyone freely.", "Not currently in use; not taken; unoccupied.", "Privileged or individual; proprietary.", "Intended for release, as opposed to a checked version.", "In any of various technical senses generic, universal.", "Ready; eager; acting without spurring or whipping; spirited.", "Complimentary.", "Unconstrained of identifiers, not bound.", "Unconstrained.", "Generous; liberal.", "Unobstructed, without blockages.", "Such that any map f from X to the underlying set of an object A in the same category as F induces a map ̄f from F to A which is compatible with f (i.e. such that f=̄f∘i).", "Not attached; loose.", "Upholding individual rights.", "Invested with a particular freedom or franchise; enjoying certain immunities or privileges; admitted to special rights; followed by of.", "Without obligations.", "Unconstrained by quantifiers.", "Having a set of generators which satisfy no non-trivial relations; equivalently, being the group of reduced words on a set of generators.", "Clear of offence or crime; guiltless; innocent.", "Unattached or uncombined."]}, {"pos": "adv", "definitions": ["Without needing to pay.", "Freely; willingly."]}, {"pos": "verb", "definitions": ["To relinquish (previously allocated memory) to the system.", "To make free; set at liberty; release.", "To rid of something that confines or oppresses."]}, {"pos": "noun", "definitions": ["Abbreviation of freestyle.", "A free transfer.", "Abbreviation of free kick.", "The usual means of restarting play after a foul is committed, where the non-offending team restarts from where the foul was committed."]}], "ipa": "/fɹiː/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/c/c9/En-uk-free.ogg/En-uk-free.ogg.mp3", "translations": ["libre", "gratis", "librar"], "difficulty": 0, "categories": ["travel", "education", "work"], "syllable_count": 1}, {"word": "thesaurus", "definitions": [{"pos": "noun", "definitions": ["A hierarchy of subject headings: canonical titles of themes and topics, the titles serving as search keys.", "A dictionary or encyclopedia.", "A publication that provides synonyms (and sometimes antonyms and other semantic relations) for the words of a given language."]}], "ipa": "/θɪˈsɔːɹəs/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/7/75/LL-Q1860_%28eng%29-Vealhurl-thesaurus.wav/LL-Q1860_%28eng%29-Vealhurl-thesaurus.wav.mp3", "translations": ["diccionario de sinónimos"], "difficulty": 1, "categories": ["education", "health", "travel"], "syllable_count": 3}, {"word": "encyclopedia", "definitions": [{"pos": "noun", "definitions": ["Similarly comprehensive works in other formats.", "The circle of arts and sciences; a comprehensive summary of knowledge, or of a branch of knowledge.", "A comprehensive reference work (often spanning several printed volumes) with articles (usually arranged in alphabetical order, or sometimes arranged by category) on a range of subjects, sometimes general, sometimes limited to a particular field."]}], "ipa": "/ənˌsəɪ.kləˈpi.di.ə/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/d/d1/En-us-encyclopedia.ogg/En-us-encyclopedia.ogg.mp3", "translations": ["enciclopedia"], "difficulty": 2, "categories": ["education", "health", "work"], "syllable_count": 5}, {"word": "portmanteau", "definitions": [{"pos": "noun", "definitions": ["A large travelling case usually made of leather, and opening into two equal sections.", "A schoolbag.", "A hook on which to hang clothing.", "A portmanteau film.", "A word formed by putting two words together and thereby their meaning e.g. shrinkflation."]}, {"pos": "adj", "definitions": ["Made by combining two (or more) words, stories, etc., in the manner of a linguistic portmanteau."]}, {"pos": "verb", "definitions": ["To create a portmanteau word."]}], "ipa": "/pɔːtˈmæn.təʊ/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/f/f2/En-us-portmanteau-1.ogg/En-us-portmanteau-1.ogg.mp3", "translations": ["maleta"], "difficulty": 1, "categories": ["health", "education", "work"], "syllable_count": 3}, {"word": "cat", "definitions": [{"pos": "noun", "definitions": ["The game of trap ball.", "An animal of the family Felidae:", "A spiteful or angry woman.", "A wheeled shelter, used in the Middle Ages as a siege weapon to allow assailants to approach enemy defences.", "An animal of the family Felidae", "A double tripod (for holding a plate, etc.) with six feet, of which three rest on the ground, in whatever position it is placed.", "The pointed piece of wood that is struck in the game of tipcat.", "Short for cat-o'-nine-tails.", "A prostitute.", "The meat of this animal, eaten as food.", "A domesticated species (Felis catus) of feline animal, commonly kept as a house pet.", "An enthusiast or player of jazz.", "A strong tackle used to hoist an anchor to the cathead of a ship.", "A vagina or vulva.", "The trap in that game.", "Any similar animal of the family Felidae, which includes lions, tigers, bobcats, leopards, cougars, cheetahs, caracals, lynxes, and other such non-domesticated species.", "A person (usually male).", "A person:", "A sturdy merchant sailing vessel (now only in \"catboat\").", "A program and command in Unix that reads one or more files and directs their content to the standard output.", "A street name of the drug methcathinone.", "Abbreviation of category.", "Abbreviation of catamaran.", "Abbreviation of computed axial tomography. Often used attributively, as in “CAT scan” or “CT scan”.", "Abbreviation of catapult.", "A ground vehicle which uses caterpillar tracks, especially tractors, trucks, minibuses, and snow groomers.", "Any of a variety of earth-moving machines. (from their manufacturer Caterpillar Inc.)", "Abbreviation of catalytic converter.", "Abbreviation of caterpillar.", "Abbreviation of catfish."]}, {"pos": "verb", "definitions": ["To hoist (an anchor) by its ring so that it hangs at the cathead.", "To vomit.", "To gossip in a catty manner.", "To go wandering at night.", "To flog with a cat-o'-nine-tails.", "To apply the cat command to (one or more files).", "To dump large amounts of data on (an unprepared target), usually with no intention of browsing it carefully."]}, {"pos": "adj", "definitions": ["Catastrophic; terrible, disastrous."]}], "ipa": "/kæt/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/1/1e/En-uk-a_cat.ogg/En-uk-a_cat.ogg.mp3", "translations": ["gato"], "difficulty": 0, "categories": ["travel", "health", "work"], "syllable_count": 1}, {"word": "word", "definitions": [{"pos": "noun", "definitions": ["A sequence of letters, characters, or sounds, considered as a discrete entity, though it does not necessarily belong to a language or have a meaning.", "A watchword or rallying cry, a verbal signal (even when consisting of multiple words).", "The smallest discrete unit of written language with a particular meaning, composed of one or more letters or symbols and one or more morphemes", "A brief discussion or conversation.", "A fixed-size group of bits handled as a unit by a machine and which can be stored in or retrieved from a typical register (so that it has the same size as such a register).", "Communication from God; the message of the Christian gospel; the Bible, Scripture.", "A discrete, meaningful unit of language approved by an authority or native speaker (compare non-word).", "A promise; an oath or guarantee.", "An order; a request or instruction; an expression of will.", "A proverb or motto.", "Something like such a unit of language:", "A finite string that is not a command or operator.", "See words.", "A group element, expressed as a product of group elements.", "News; tidings.", "A minor reprimand.", "The smallest discrete unit of spoken language with a particular meaning, composed of one or more phonemes and one or more morphemes", "Something that someone said; a comment, utterance; speech.", "The fact or act of speaking, as opposed to taking action. .", "The smallest unit of language that has a particular meaning and can be expressed by itself; the smallest discrete, meaningful unit of language. (contrast morpheme.)", "A unit of text equivalent to five characters and one space.", "Logos, Christ."]}, {"pos": "verb", "definitions": ["To speak, to use words; to converse, to discourse.", "To ply or overpower with words.", "To say or write (something) using particular words; to phrase (something).", "To conjure with a word.", "To flatter with words, to cajole.", "Alternative form of worth (“to become”)."]}, {"pos": "intj", "definitions": ["Truth, indeed, that is the truth! The shortened form of the statement \"My word is my bond.\"", "An abbreviated form of word up; a statement of the acknowledgment of fact with a hint of nonchalant approval."]}], "ipa": "/wɜːd/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/b/bf/En-us-word.ogg/En-us-word.ogg.mp3", "translations": ["palabra", "redactar"], "difficulty": 0, "categories": ["education", "work", "health"], "syllable_count": 1}, {"word": "book", "definitions": [{"pos": "noun", "definitions": ["A list of the races that a jockey is scheduled to ride in.", "A list of all players who have been booked (received a warning) in a game.", "A record of betting (from the use of a notebook to record what each person has bet).", "Records of the accounts of a business.", "A collection of sheets of paper bound together to hinge at one edge, containing printed or written material, pictures, etc.", "A major division of a long work.", "A document, held by the referee, of the incidents that happened in a game.", "A long work fit for publication, typically prose, such as a novel or textbook, and typically published as such a bound collection of sheets, but now sometimes electronically as an e-book.", "Four of a kind.", "Six tricks taken by one side.", "The accumulated body of knowledge passed down among black pimps.", "The script of a musical or opera.", "A bookmaker (a person who takes bets on sporting events and similar); bookie; turf accountant.", "A convenient collection, in a form resembling a book, of small paper items for individual use.", "The sum of chess knowledge in the opening or endgame.", "The twenty-sixth Lenormand card.", "Any source of instruction.", "A portfolio of one's previous work in the industry.", "A book award, a recognition for receiving the highest grade in a class (traditionally an actual book, but recently more likely a letter or certificate acknowledging the achievement).", "The list of mares that a stallion will breed in a given season."]}, {"pos": "verb", "definitions": ["To record bets as bookmaker.", "To travel very fast.", "To write down, to register or record in a book or as in a book.", "To leave.", "To receive the highest grade in a class.", "To reserve (something) for future use.", "To add a name to the list of people who are participating in something.", "To record the name and other details of a suspected offender and the offence for later judicial action.", "To issue a caution to, usually a yellow card, or a red card if a yellow card has already been issued.", "simple past of bake"]}], "ipa": "/bʊk/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/7/70/En-uk-book.ogg/En-uk-book.ogg.mp3", "translations": ["libro", "reservar"], "difficulty": 0, "categories": ["education", "work", "health"], "syllable_count": 1}, {"word": "pound", "definitions": [{"pos": "noun", "definitions": ["A unit of mass in various measurement systems.", "Short for pound-force.", "Ellipsis of pound weight.", "The symbol #.", "Ellipsis of pound mass.", "A unit of mass equal to 12 troy ounces (≈ 373.242 g). Today, this is a common unit of mass when measuring precious metals, and is little used elsewhere.", "Various non-English units of measure.", "A unit of mass equal to 16 avoirdupois ounces (= 453.592 g). Today this value is the most common meaning of \"pound\" as a unit of weight.", "A unit of force in various measurement systems", "A unit of weight in various measurement systems.", "A unit of currency in various currency systems.", "Ellipsis of pound force.", "The unit of currency used in the United Kingdom and its dependencies. It is divided into 100 pence. Symbol £.", "Various non-English units of currency.", "Any of various units of currency formerly used in the United States.", "Any of various units of currency used in Egypt, Lebanon, Sudan and Syria, and formerly in the Republic of Ireland, Cyprus, Israel and South Africa.", "A kind of fishing net, having a large enclosure with a narrow entrance into which fish are directed by wings spreading outward.", "A section of a canal between two adjacent locks.", "The people who work for the pound.", "A place for the detention of stray or wandering animals.", "A place for the detention of automobiles that have been illegally parked, abandoned, etc.", "A division inside a fishing stage where cod is cured in salt brine.", "A hard blow."]}, {"pos": "verb", "definitions": ["To wager a pound on.", "To confine in, or as in, a pound; to impound.", "To advance heavily with measured steps.", "To penetrate sexually, with vigour.", "To make a jarring noise, as when running.", "To crush to pieces; to pulverize.", "To pitch consistently to a certain location.", "To strike hard, usually repeatedly.", "To eat or drink very quickly.", "To beat strongly or throb."]}], "ipa": "/paʊnd/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/5/58/En-us-pound.ogg/En-us-pound.ogg.mp3", "translations": ["libra", "perrera", "pilar"], "difficulty": 0, "categories": ["travel", "health", "work"], "syllable_count": 1}, {"word": "GDP", "definitions": [{"pos": "noun", "definitions": ["Initialism of gross domestic product.", "Initialism of guanosine diphosphate, a nucleotide."]}], "ipa": "/ˌd͡ʒiːdiːˈpiː/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/8/86/En-us-GDP.ogg/En-us-GDP.ogg.mp3", "translations": ["PIB"], "difficulty": 0, "categories": ["education", "work", "travel"], "syllable_count": 1}, {"word": "pond", "definitions": [{"pos": "noun", "definitions": ["An inland body of standing water, either natural or man-made, that is smaller than a lake.", "An inland body of standing water of any size that is fed by springs rather than by a river.", "Chiefly in across the pond: the Atlantic Ocean."]}, {"pos": "verb", "definitions": ["To block the flow of water so that it can escape only through evaporation or seepage; to dam.", "To form a pond; to pool.", "To make into a pond; to collect, as water, in a pond by damming.", "To ponder."]}], "ipa": "/pɒnd/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/3/38/En-us-pond.ogg/En-us-pond.ogg.mp3", "translations": ["charca"], "difficulty": 0, "categories": ["travel", "education", "health"], "syllable_count": 1}, {"word": "nonsense", "definitions": [{"pos": "noun", "definitions": ["Letters or words, in writing or speech, that have no meaning or pattern or seem to have no meaning.", "A type of poetry that contains strange or surreal ideas, as, for example, that written by Edward Lear.", "That which is silly, illogical and lacks any meaning, reason or value; that which does not make sense.", "An untrue statement.", "A damaged DNA sequence whose products are not biologically active, that is, that does nothing.", "Something foolish."]}, {"pos": "verb", "definitions": ["To joke around, to waste time", "To make nonsense of;", "To attempt to dismiss as nonsense; to ignore or belittle the significance of something; to render unimportant or puny."]}, {"pos": "adj", "definitions": ["Resulting from the substitution of a nucleotide in a sense codon, causing it to become a stop codon (not coding for an amino-acid).", "Nonsensical."]}, {"pos": "intj", "definitions": ["An emphatic rejection of something one has just heard and does not believe or agree with."]}], "ipa": "/ˈnɒn.səns/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/8/86/En-us-nonsense.ogg/En-us-nonsense.ogg.mp3", "translations": ["tontería", "sin sentido"], "difficulty": 1, "categories": ["work", "travel", "education"], "syllable_count": 3}, {"word": "pie", "definitions": [{"pos": "noun", "definitions": ["The whole of a wealth or resource, to be divided in parts.", "A pie chart.", "A type of pastry that consists of an outer crust and a filling. (Savory pies are more popular in the UK and sweet pies are more popular in the US, so \"pie\" without qualification has different connotations in these dialects.)", "Any of various other, non-pastry dishes that maintain the general concept of a shell with a filling.", "Something very easy; a piece of cake.", "A kilogram of drugs, especially cocaine.", "An especially badly bowled ball.", "The vulva.", "A paper plate covered in cream, shaving foam or custard that is thrown or rubbed in someone’s face for comical purposes, to raise money for charity, or as a form of political protest; a custard pie; a cream pie.", "A pizza.", "Magpie.", "A former low-denomination coin of northern India.", "Ellipsis of pie-dog: an Indian breed, a stray dog in Indian contexts.", "A traditional Spanish unit of length, equivalent to about 27.9 cm.", "Alternative form of pi (“metal type that has been spilled, mixed together, or disordered”)"]}, {"pos": "verb", "definitions": ["To go around (a corner) in a guarded manner.", "To hit in the face with a pie, either for comic effect or as a means of protest (see also pieing).", "To ignore (someone).", "Alternative form of pi (“to spill or mix printing type”)"]}], "ipa": "/paɪ/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/6/61/En-us-pie.ogg/En-us-pie.ogg.mp3", "translations": ["pastel"], "difficulty": 0, "categories": ["travel", "health", "work"], "syllable_count": 1}, {"word": "crow", "definitions": [{"pos": "noun", "definitions": ["A black person.", "A bird, usually black, of the genus Corvus, having a strong conical beak, with projecting bristles; it has a harsh, croaking call.", "A bar of iron with a beak, crook or claw; a bar of iron used as a lever; a crowbar.", "Any of various dark-coloured nymphalid butterflies of the genus Euploea.", "An ill-tempered and obstinate woman, or one who otherwise has features resembling the bird; a harpy.", "The mesentery of an animal.", "A gangplank (corvus) used by the Ancient Roman navy to board enemy ships.", "Someone who keeps watch while their associates commit a crime; a lookout.", "The emblem of an eagle, a sign of military rank.", "The cry or call of a rooster or a cockerel, especially as heard at sunrise.", "Alternative spelling of cro (“marijuana”)"]}, {"pos": "adj", "definitions": ["Dark black, the color of a crow; crow-black."]}, {"pos": "verb", "definitions": ["To test the reed of a double reed instrument by placing the reed alone in the mouth and blowing it.", "To shout in exultation or defiance; to brag.", "To make the shrill sound characteristic of a rooster; to make a sound in this manner, either in gaiety, joy, pleasure, or defiance."]}], "ipa": "/kɹəʊ/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/6/6a/En-us-crow.ogg/En-us-crow.ogg.mp3", "translations": ["corneja", "cacarear"], "difficulty": 0, "categories": ["travel", "work", "health"], "syllable_count": 1}, {"word": "raven", "definitions": [{"pos": "noun", "definitions": ["Any of several, generally large and lustrous black species of birds in the genus Corvus, especially the common raven (Corvus corax).", "A jet-black color.", "Rapine; rapacity.", "Prey; plunder; food obtained by violence."]}, {"pos": "adj", "definitions": ["Of the color of the raven; jet-black."]}, {"pos": "verb", "definitions": ["To show rapacity; to be greedy (for something).", "To devour with great eagerness.", "To obtain or seize by violence.", "To prey on with rapacity."]}], "ipa": "/ˈɹeɪvən/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/2/2f/En-us-raven.ogg/En-us-raven.ogg.mp3", "translations": ["cuervo"], "difficulty": 0, "categories": ["travel", "work", "education"], "syllable_count": 2}, {"word": "elephant", "definitions": [{"pos": "noun", "definitions": ["Ivory.", "Synonym of elephant paper", "Anything huge and ponderous.", "Any member of the subfamily Elephantinae not also of the genera Mammuthus and Primelephas.", "A xiangqi piece that is moved two points diagonally, may not jump over intervening pieces and may not cross the river.", "A mammal of the order Proboscidea, having a trunk, and two large ivory tusks jutting from the upper jaw.", "used when counting to add length, so that each count takes about one second"]}], "ipa": "/ˈɛlɪf(ə)nt/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/f/f2/En-us-elephant.ogg/En-us-elephant.ogg.mp3", "translations": ["elefante"], "difficulty": 1, "categories": ["health", "work", "travel"], "syllable_count": 3}, {"word": "brown", "definitions": [{"pos": "noun", "definitions": ["A brown trout (Salmo trutta).", "One of the colour balls used in snooker, with a value of 4 points.", "A copper coin.", "Any of certain species of nymphalid butterflies of subfamily Satyrinae, such as those of the genera Heteronympha and Melanitis.", "A colour like that of chocolate or coffee.", "A mass of birds or animals that may be indiscriminately fired at.", "Any of various nymphalid butterflies of subfamily Satyrinae (formerly the family Satyridae).", "Black tar heroin.", "A person of Latino, Middle Eastern or South Asian descent; a brown-skinned person; someone of mulatto, or biracial appearance.", "A brown horse or other animal."]}, {"pos": "adj", "definitions": ["Southeast Asian", "Latino", "Gloomy.", "of color.", "Of or relating to any of various ethnic groups having dark pigmentation of the skin.", "South Asian or sometimes Middle Eastern or North African", "Not green: not environmentally responsible.", "Having a brown colour."]}, {"pos": "verb", "definitions": ["To cook something until it becomes brown.", "To tan.", "To turn progressively more Hispanic or Latino, in the context of the population of a geographic region.", "To make brown or dusky.", "To become brown.", "To give a bright brown colour to, as to gun barrels, by forming a thin coating of oxide on their surface."]}], "ipa": "/bɹaʊn/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/2/29/En-us-brown.ogg/En-us-brown.ogg.mp3", "translations": ["marrón", "marrón", "pardear"], "difficulty": 0, "categories": ["work", "travel", "education"], "syllable_count": 1}, {"word": "December", "definitions": [{"pos": "name", "definitions": ["The twelfth and last month of the Gregorian calendar, following November and preceding the January of the following year, containing the southern solstice.", "A surname.", "A female given name transferred from the month name [in turn from English]."]}], "ipa": "/dɪˈsɛmbə/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/9/92/En-us-December.ogg/En-us-December.ogg.mp3", "translations": ["diciembre"], "difficulty": 1, "categories": ["education", "work", "travel"], "syllable_count": 3}, {"word": "month", "definitions": [{"pos": "noun", "definitions": ["A period of 30 days, 31 days, or some alternation thereof.", "A period into which a year is divided, historically based on the phases of the moon.", "A woman's period; menstrual discharge."]}], "ipa": "/mʌnθ/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/b/b6/En-uk-a_month.ogg/En-uk-a_month.ogg.mp3", "translations": ["mes"], "difficulty": 0, "categories": ["travel", "work", "education"], "syllable_count": 1}, {"word": "January", "definitions": [{"pos": "name", "definitions": ["A female given name transferred from the month name [in turn from English].", "The first month of the Gregorian calendar, following the December of the previous year and preceding February. Abbreviation: Jan or Jan."]}], "ipa": "/ˈd͡ʒæn.j(ʊ.)ə.ɹi/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/8/8c/En-us-January.ogg/En-us-January.ogg.mp3", "translations": ["enero"], "difficulty": 1, "categories": ["education", "work", "travel"], "syllable_count": 3}, {"word": "February", "definitions": [{"pos": "name", "definitions": ["The short month following January and preceding March in the Roman, Julian, and Gregorian calendars, used in all three calendars for intercalation or addition of leap days.", "A female given name transferred from the month name [in turn from English]."]}], "ipa": "/ˈfɛb.ɹʊ.ə.ɹi/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/1/18/En-uk-february.ogg/En-uk-february.ogg.mp3", "translations": ["febrero"], "difficulty": 1, "categories": ["education", "work", "health"], "syllable_count": 3}, {"word": "march", "definitions": [{"pos": "noun", "definitions": ["Any song in the genre of music written for marching (see Wikipedia's article on this type of music)", "Steady forward movement or progression.", "The feat of taking all the tricks of a hand.", "A formal, rhythmic way of walking, used especially by soldiers, by bands, and in ceremonies.", "A journey so walked.", "A political rally or parade.", "A region at a frontier governed by a marquess.", "Any of various territories with similar meanings or etymologies in their native languages.", "A border region, especially one originally set up to defend a boundary.", "Smallage."]}, {"pos": "verb", "definitions": ["To cause someone to walk somewhere.", "To make steady progress.", "To go to war; to make military advances.", "To walk with long, regular strides, as a soldier does.", "To have common borders or frontiers"]}], "ipa": "/mɑːtʃ/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/6/6a/En-us-March.ogg/En-us-March.ogg.mp3", "translations": ["marcha", "marchar", "marca"], "difficulty": 0, "categories": ["travel", "health", "work"], "syllable_count": 1}, {"word": "April", "definitions": [{"pos": "name", "definitions": ["A surname.", "The fourth month of the Gregorian calendar, following March and preceding May. Abbreviation: Apr or Apr.", "A female given name transferred from the month name [in turn from English]; used since the early 20th century."]}], "ipa": "/ˈeɪ.pɹɪl/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/3/35/En-us-April.ogg/En-us-April.ogg.mp3", "translations": ["abril"], "difficulty": 0, "categories": ["education", "work", "health"], "syllable_count": 2}, {"word": "may", "definitions": [{"pos": "verb", "definitions": ["To be able to go.", "Used in modesty, courtesy, or concession, or to soften a question or remark.", "Expressing a present possibility; possibly.", "Expressing a wish (with present subjunctive effect).", "To have permission to, be allowed. Used in granting permission and in questions to make polite requests.", "To be strong; to have power (over).", "To be able; can.", "Granting the admissibility of a supposition, in a way that can be semantically either subjunctive or indicative.", "Expressing a disjunctive or contrastive relation between indicative statements.", "To celebrate May Day.", "To gather may, or flowers in general."]}, {"pos": "noun", "definitions": ["The hawthorn bush or its blossoms.", "A maiden."]}], "ipa": "/meɪ/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/5/54/En-us-May.ogg/En-us-May.ogg.mp3", "translations": ["poder", "espino"], "difficulty": 0, "categories": ["education", "work", "health"], "syllable_count": 1}, {"word": "June", "definitions": [{"pos": "name", "definitions": ["The sixth month of the Gregorian calendar, following May and preceding July. Abbreviation: Jun or Jun.", "A female given name transferred from the month name [in turn from English], for a girl born in June, used since the end of the 19th century.", "A male given name, or more often nickname, for a boy who is junior to someone else, especially someone with the same name, such as his father."]}], "ipa": "/d͡ʒuːn/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/9/97/En-us-June.ogg/En-us-June.ogg.mp3", "translations": ["junio"], "difficulty": 0, "categories": ["work", "education", "travel"], "syllable_count": 1}, {"word": "July", "definitions": [{"pos": "name", "definitions": ["The seventh month of the Gregorian calendar, following June and preceding August. Abbreviation: Jul or Jul.", "A female given name from English.", "A surname from French."]}], "ipa": "/d͡ʒʊˈlaɪ/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/a/a1/En-us-July.ogg/En-us-July.ogg.mp3", "translations": ["julio"], "difficulty": 0, "categories": ["work", "education", "travel"], "syllable_count": 2}, {"word": "august", "definitions": [{"pos": "adj", "definitions": ["Awe-inspiring, majestic, noble, venerable.", "Of noble birth."]}, {"pos": "verb", "definitions": ["To bring to realization.", "To make ripe; ripen."]}, {"pos": "noun", "definitions": ["Alternative form of auguste (“kind of clown”)"]}], "ipa": "/ɔːˈɡʌst/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/4/48/En-us-august.ogg/En-us-august.ogg.mp3", "translations": ["majestuoso"], "difficulty": 0, "categories": ["work", "education", "travel"], "syllable_count": 2}, {"word": "September", "definitions": [{"pos": "name", "definitions": ["A female or male given name transferred from the month name [in turn from English].", "The ninth month of the Gregorian calendar, following August and preceding October. Abbreviations: Sep or Sep., Sept or Sept."]}], "ipa": "/sɛpˈtɛmbə/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/5/5b/En-us-September.ogg/En-us-September.ogg.mp3", "translations": ["septiembre"], "difficulty": 1, "categories": ["education", "work", "travel"], "syllable_count": 3}, {"word": "October", "definitions": [{"pos": "name", "definitions": ["A female given name transferred from the month name.", "The tenth month of the Gregorian calendar, following September and preceding November. Abbreviation: Oct."]}, {"pos": "noun", "definitions": ["A type of ale traditionally brewed in October."]}, {"pos": "verb", "definitions": ["In the early Soviet Union, to give a child a name tinged with Soviet revolutionary thought, as opposed to religious christening."]}], "ipa": "/ɒkˈtəʊ.bə/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/2/26/En-us-October.ogg/En-us-October.ogg.mp3", "translations": ["octubre"], "difficulty": 0, "categories": ["work", "education", "travel"], "syllable_count": 3}, {"word": "November", "definitions": [{"pos": "name", "definitions": ["A female given name.", "The eleventh month of the Gregorian calendar, following October and preceding December. Abbreviation: Nov or Nov."]}], "ipa": "/nəʊˈvɛmbə/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/4/4f/En-us-November.ogg/En-us-November.ogg.mp3", "translations": ["noviembre"], "difficulty": 1, "categories": ["health", "education", "work"], "syllable_count": 3}, {"word": "multiculturalism", "definitions": [{"pos": "noun", "definitions": ["The characteristics of an organization, society, city etc. which has many different ethnic or national cultures mingling freely; political or social policies which support or encourage such coexistence.", "the cultural Marxism conspiracy theory."]}], "ipa": "/ˌmʌltɪˈkʌltʃəɹəˌlɪz(ə)m/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/e/ec/En-au-multiculturalism.ogg/En-au-multiculturalism.ogg.mp3", "translations": ["multiculturalismo"], "difficulty": 2, "categories": ["travel", "social life", "education"], "syllable_count": 6}, {"word": "day", "definitions": [{"pos": "noun", "definitions": ["An observance lasting for a day, such as an annual holiday.", "A specified time or period; time, considered with reference to the existence or prominence of a person or thing; age; time; era.", "A 24-hour period beginning at 6am or sunrise.", "The rotational period of a planet.", "A period of time between two set times which mark the beginning and the end of day in a calendar, such as from midnight to the following midnight or (Judaism) from nightfall to the following nightfall.", "A period of time equal or almost equal to a full day-night cycle.", "A period of contention of a day or less.", "The time taken for the Earth to make a full rotation about its axis with respect to the fixed stars; a sidereal day or stellar day.", "The part of a day period which one spends at one’s job, school, etc.", "The time when the Sun is above the horizon and it lights the sky.", "The time taken for the Sun to seem to be in the same place in the sky twice; a solar day."]}, {"pos": "verb", "definitions": ["To spend a day (in a place)."]}], "ipa": "/deɪ/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/3/31/En-uk-a_day.ogg/En-uk-a_day.ogg.mp3", "translations": ["día"], "difficulty": 0, "categories": ["daily life", "travel", "education"], "syllable_count": 1}, {"word": "Monday", "definitions": [{"pos": "noun", "definitions": ["The second day of the week in many religious traditions, and the first day of the week in systems using the ISO 8601 norm. It follows Sunday and precedes Tuesday."]}, {"pos": "adv", "definitions": ["On Monday."]}], "ipa": "/ˈmʌn.deɪ/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/6/63/En-us-Monday.ogg/En-us-Monday.ogg.mp3", "translations": ["lunes"], "difficulty": 0, "categories": ["work", "education", "travel"], "syllable_count": 2}, {"word": "Tuesday", "definitions": [{"pos": "noun", "definitions": ["The third day of the week in many religious traditions, and the second day of the week in systems that use the ISO 8601 norm; it follows Monday and precedes Wednesday.", "An ordinary, unmemorable day."]}, {"pos": "adv", "definitions": ["On Tuesday."]}], "ipa": "/ˈtjuːzdeɪ/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/d/dc/En-us-Tuesday.ogg/En-us-Tuesday.ogg.mp3", "translations": ["martes", "martes"], "difficulty": 0, "categories": ["education", "work", "travel"], "syllable_count": 2}, {"word": "Wednesday", "definitions": [{"pos": "noun", "definitions": ["The fourth day of the week in many religious traditions, and the third day of the week in systems using the ISO 8601 norm; it follows Tuesday and precedes Thursday."]}, {"pos": "name", "definitions": ["nickname of Sheffield Wednesday of the Football League."]}, {"pos": "adv", "definitions": ["On Wednesday."]}], "ipa": "/ˈwɛnzdeɪ/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/d/d3/En-uk-Wednesday.ogg/En-uk-Wednesday.ogg.mp3", "translations": ["miércoles"], "difficulty": 1, "categories": ["education", "work", "travel"], "syllable_count": 3}, {"word": "Thursday", "definitions": [{"pos": "noun", "definitions": ["The fifth day of the week in many religious traditions, and the fourth day of the week in systems using the ISO 8601 norm; it follows Wednesday and precedes Friday."]}, {"pos": "adv", "definitions": ["On Thursday."]}], "ipa": "/ˈθɜːzdeɪ/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/e/ed/En-uk-Thursday.ogg/En-uk-Thursday.ogg.mp3", "translations": ["jueves", "el jueves"], "difficulty": 0, "categories": ["education", "work", "travel"], "syllable_count": 2}, {"word": "Friday", "definitions": [{"pos": "noun", "definitions": ["The sixth day of the week in many religious traditions, and the fifth day of the week in systems using the ISO 8601 norm; the Muslim Sabbath; it follows Thursday and precedes Saturday.", "The last workday in a work schedule that is not Monday through Friday."]}, {"pos": "adv", "definitions": ["On Friday."]}], "ipa": "/ˈfɹaɪdeɪ/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/2/22/En-uk-Friday.ogg/En-uk-Friday.ogg.mp3", "translations": ["viernes", "el viernes"], "difficulty": 0, "categories": ["education", "work", "travel"], "syllable_count": 2}, {"word": "Saturday", "definitions": [{"pos": "noun", "definitions": ["The seventh day of the week in many religious traditions, and the sixth day of the week in systems using the ISO 8601 norm; the Jewish Sabbath; it follows Friday and precedes Sunday."]}, {"pos": "adv", "definitions": ["On Saturday."]}, {"pos": "verb", "definitions": ["To spend Saturday (at a place or doing an activity)."]}], "ipa": "/ˈsætədeɪ/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/9/9c/En-uk-Saturday.ogg/En-uk-Saturday.ogg.mp3", "translations": ["sábado"], "difficulty": 0, "categories": ["education", "work", "travel"], "syllable_count": 3}, {"word": "Sunday", "definitions": [{"pos": "noun", "definitions": ["Describes someone who does something occasionally or casually, and therefore without skill.", "A newspaper published on Sunday.", "The first day of the week in many religious traditions, and the seventh day of the week in systems using the ISO 8601 standard; the Christian Sabbath; the Lord's Day; it follows Saturday and precedes Monday.", "A comic strip published in a Sunday newspaper."]}, {"pos": "verb", "definitions": ["To spend Sunday (at a certain place, with a certain person or people, etc.)."]}, {"pos": "adv", "definitions": ["On Sunday."]}], "ipa": "/ˈsʌn.deɪ/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/3/3e/En-us-Sunday.ogg/En-us-Sunday.ogg.mp3", "translations": ["domingo"], "difficulty": 0, "categories": ["work", "education", "travel"], "syllable_count": 2}, {"word": "lexicography", "definitions": [{"pos": "noun", "definitions": ["The scholarly discipline of analysing and describing the semantic, syntagmatic and paradigmatic relationships within the lexicon (vocabulary) of a language and developing theories of dictionary components and structures linking the data in dictionaries.", "The art or craft of compiling, writing, and editing dictionaries.", "A dictionary, a lexicon, a wordbook."]}], "ipa": "/ˌlɛksɪˈkɒɡɹəfi/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/2/21/LL-Q1860_%28eng%29-Vealhurl-lexicography.wav/LL-Q1860_%28eng%29-Vealhurl-lexicography.wav.mp3", "translations": ["lexicografía"], "difficulty": 2, "categories": ["education", "work", "travel"], "syllable_count": 5}, {"word": "antonym", "definitions": [{"pos": "noun", "definitions": ["A word that describes one end of a scale, while its opposite describes the other end, such as large versus small; a gradable antonym.", "A word which has the opposite meaning of another word."]}], "ipa": "/ˈæn.təˌnɪm/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/3/34/En-us-antonym.ogg/En-us-antonym.ogg.mp3", "translations": ["antónimo"], "difficulty": 1, "categories": ["work", "travel", "education"], "syllable_count": 3}, {"word": "connotation", "definitions": [{"pos": "noun", "definitions": ["The attribute or aggregate of attributes connoted by a term, contrasted with denotation.", "A meaning of a word or phrase that is suggested or implied, as opposed to a denotation, or literal meaning. A characteristic of words or phrases, or of the contexts that words and phrases are used in."]}], "ipa": "/ˌkɑnəˈteɪʃən/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/6/62/LL-Q1860_%28eng%29-Vealhurl-connotation.wav/LL-Q1860_%28eng%29-Vealhurl-connotation.wav.mp3", "translations": ["connotación"], "difficulty": 1, "categories": ["education", "travel", "work"], "syllable_count": 4}, {"word": "denotation", "definitions": [{"pos": "noun", "definitions": ["A first level of analysis: what the audience can visually see on a page. Denotation often refers to something literal, and avoids being a metaphor.", "Something signified or referred to; a particular meaning of a symbol", "The act of denoting, or something (such as a symbol) that denotes", "The intension and extension of a word", "The primary, surface, literal, or explicit meaning of a signifier such as a word, phrase, or symbol; that which a word denotes, as contrasted with its connotation; the aggregate or set of objects of which a word may be predicated.", "Any mathematical object which describes the meanings of expressions from the languages, formalized in the theory of denotational semantics"]}], "ipa": "/ˌdiː.noʊˈteɪ.ʃən/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/4/47/En-us-denotation.ogg/En-us-denotation.ogg.mp3", "translations": ["denotación"], "difficulty": 2, "categories": ["work", "education", "travel"], "syllable_count": 4}, {"word": "synonym", "definitions": [{"pos": "noun", "definitions": ["An alternative (often shorter) name defined for an object in a database.", "Any of the various names that could in theory be used for a taxon in accordance with the relevant rules.", "A word or term whose meaning is the same as that of another.", "Any name that has been applied to a taxon other than the one to be used, including those not allowed by the rules such as misspellings or nomina nuda.", "The subset of those names other than the one to be used according to the rules.", "A word or phrase with a meaning that is the same as, or very similar to, another word or phrase."]}], "ipa": "/ˈsɪn.əˌnɪm/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/5/52/En-us-synonym.ogg/En-us-synonym.ogg.mp3", "translations": ["sinónimo"], "difficulty": 1, "categories": ["travel", "education", "work"], "syllable_count": 3}, {"word": "dialect", "definitions": [{"pos": "noun", "definitions": ["A variant form of the vocalizations of a bird species restricted to a certain area or population.", "A variant of a non-standardized programming language.", "A language existing only in an oral or non-standardized form, especially a language spoken in a developing country or an isolated region.", "Language that is perceived as substandard or wrong.", "A variety of a language that is characteristic of a particular area, community, or social group, differing from other varieties of the same language in relatively minor ways as regards grammar, phonology, and lexicon.", "A lect (often a regional or minority language) as part of a group or family of languages, especially if they are viewed as a single language, or if contrasted with a standardized idiom that is considered the 'true' form of the language (for example, Bavarian as contrasted with Standard German)."]}], "ipa": "/ˈdaɪ.əˌlɛkt/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/5/5f/En-us-dialect.ogg/En-us-dialect.ogg.mp3", "translations": ["dialecto"], "difficulty": 0, "categories": ["education", "health", "work"], "syllable_count": 2}, {"word": "hyponym", "definitions": [{"pos": "noun", "definitions": ["A more specific term; a subordinate grouping word or phrase; a term designating a subclass of another more general class described by the given word."]}], "ipa": "/ˈhaɪpəʊ.nɪm/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/0/03/En-ca-hyponym.ogg/En-ca-hyponym.ogg.mp3", "translations": ["hipónimo"], "difficulty": 1, "categories": ["work", "education", "health"], "syllable_count": 3}, {"word": "semantics", "definitions": [{"pos": "noun", "definitions": ["Pettiness or triviality.", "A branch of linguistics studying the meaning of words.", "The individual meanings of words, as opposed to the overall meaning of a passage.", "The meaning of computer language constructs, in contrast to their form or syntax.", "The study of the relationship between words and their meanings."]}], "ipa": "/sɪˈmæntɪks/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/e/eb/LL-Q1860_%28eng%29-Vealhurl-semantics.wav/LL-Q1860_%28eng%29-Vealhurl-semantics.wav.mp3", "translations": ["semántica"], "difficulty": 1, "categories": ["education", "travel", "work"], "syllable_count": 3}, {"word": "false friend", "definitions": [{"pos": "noun", "definitions": ["A word in a language that bears a deceptive resemblance to a word in another language but in fact has a different meaning.", "Used other than figuratively or idiomatically: see false, friend."]}], "ipa": "/ˌfɒls ˈfɹɛnd/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/1/1c/En-us-false_friend.ogg/En-us-false_friend.ogg.mp3", "translations": ["falso amigo"], "difficulty": 1, "categories": ["social life", "work", "travel"], "syllable_count": 3}, {"word": "noun", "definitions": [{"pos": "noun", "definitions": ["Either a word that can be used to refer to a person, animal, place, thing, phenomenon, substance, quality or idea, or a word that modifies or describes a previous word or its referent; a substantive or adjective, sometimes also including other parts of speech such as numeral or pronoun.", "A word that functions as the name of a specific object or set of objects, such as person, animal, place, word, thing, phenomenon, substance, quality, or idea: one of the basic parts of speech in many languages, including English.", "An object within a user interface to which a certain action or transformation (i.e., verb) is applied."]}, {"pos": "verb", "definitions": ["To convert a word to a noun."]}], "ipa": "/naʊn/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/e/ed/En-us-inlandnorth-noun.ogg/En-us-inlandnorth-noun.ogg.mp3", "translations": ["sustantivo"], "difficulty": 0, "categories": ["education", "work", "travel"], "syllable_count": 1}, {"word": "hour", "definitions": [{"pos": "noun", "definitions": ["The time.", "A distance that can be traveled in one hour.", "A season, moment, or time.", "Used after a two-digit hour and a two-digit minute to indicate time.", "The set times of prayer, the canonical hours, the offices or services prescribed for these, or a book containing them.", "The amount of labor demanded by an employer in terms of time.", "A unit of time of one twenty-fourth of a day (sixty minutes)."]}], "ipa": "/aʊə/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/1/18/En-uk-an_hour.ogg/En-uk-an_hour.ogg.mp3", "translations": ["hora"], "difficulty": 0, "categories": ["work", "education", "travel"], "syllable_count": 1}, {"word": "alphabetical", "definitions": [{"pos": "adj", "definitions": ["Pertaining to, furnished with, or expressed by letters of the alphabet.", "According to the sequence of the letters of the alphabet.", "literal"]}, {"pos": "noun", "definitions": ["Short for alphabetical jigsaw."]}], "ipa": "/ˌæl.fəˈbɛt.ɪ.kəl/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/6/67/En-us-alphabetical.ogg/En-us-alphabetical.ogg.mp3", "translations": ["alfabético"], "difficulty": 2, "categories": ["travel", "work", "education"], "syllable_count": 5}, {"word": "minute", "definitions": [{"pos": "noun", "definitions": ["A very small part of anything, or anything very small; a jot; a whit.", "A point in time; a moment.", "A while or a long unspecified period of time.", "A short but unspecified time period.", "A unit of time which is one sixtieth of an hour (sixty seconds).", "An old coin, a half farthing.", "A nautical or a geographic mile.", "A fixed part of a module.", "A (usually formal) written record of a meeting or a part of a meeting.", "A unit of angle equal to one-sixtieth of a degree.", "A unit of purchase on a telephone or other similar network, especially a cell phone network, roughly equivalent in gross form to sixty seconds' use of the network."]}, {"pos": "verb", "definitions": ["Of an event, to write in a memo or the minutes of a meeting.", "To set down a short sketch or note of; to jot down; to make a minute or a brief summary of."]}, {"pos": "adj", "definitions": ["Very small.", "Very careful and exact, giving small details."]}], "ipa": "/ˈmɪnɪt/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/8/83/En-uk-a_minute.ogg/En-uk-a_minute.ogg.mp3", "translations": ["minuto", "minutar", "diminuto"], "difficulty": 0, "categories": ["travel", "work", "education"], "syllable_count": 3}, {"word": "barter", "definitions": [{"pos": "noun", "definitions": ["The goods or services used in such an exchange.", "An exchange of goods or services without the use of money."]}, {"pos": "verb", "definitions": ["To exchange goods or services without involving money."]}], "ipa": "/ˈbɑː(ɹ)tə(ɹ)/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/f/f4/LL-Q1860_%28eng%29-Vealhurl-barter.wav/LL-Q1860_%28eng%29-Vealhurl-barter.wav.mp3", "translations": ["trueque", "trocar"], "difficulty": 0, "categories": ["travel", "health", "work"], "syllable_count": 2}, {"word": "etymology", "definitions": [{"pos": "noun", "definitions": ["The direct origin of a name, as in who someone was named after.", "The scientific study of the origin and evolution of a word's semantic meaning across time, including its constituent morphemes and phonemes.", "The entire catalogue of meanings that a word, morpheme, or sign has carried throughout its history.", "An account of the origin and historical development of a word as presented in a dictionary or the like."]}], "ipa": "/ˌɛtɪˈmɒləd͡ʒi/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/5/59/En-us-etymology.ogg/En-us-etymology.ogg.mp3", "translations": ["etimología"], "difficulty": 2, "categories": ["education", "work", "travel"], "syllable_count": 5}, {"word": "swap", "definitions": [{"pos": "verb", "definitions": ["To exchange or give (something) in an exchange (for something else).", "To hit, to strike.", "To beat the air, or ply the wings, with a sweeping motion or noise; to flap.", "To descend or fall; to rush hastily or violently."]}, {"pos": "noun", "definitions": ["A financial derivative in which two parties agree to exchange one stream of cashflow against another stream.", "Space available in a swap file for use as auxiliary memory.", "A social meal at a restaurant between two university societies, usually involving drinking and banter; commonly associated with fining and pennying; equivalent to a crewdate at Oxford University.", "An exchange of two comparable things.", "A blow; a stroke."]}], "ipa": "/swæp/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/f/fe/LL-Q1860_%28eng%29-M%C3%A9lange_a_trois-swap.wav/LL-Q1860_%28eng%29-M%C3%A9lange_a_trois-swap.wav.mp3", "translations": ["intercambiar", "cambalache"], "difficulty": 0, "categories": ["travel", "work", "health"], "syllable_count": 1}, {"word": "trade", "definitions": [{"pos": "noun", "definitions": ["A particular instance of buying or selling.", "A track or trail; a way; a path; passage.", "Refuse or rubbish from a mine.", "An instance of bartering items in exchange for one another.", "Course; custom; practice; occupation.", "Those engaged in an industry or group of related industries.", "A masculine man available for casual sex with men, often for pay. (Compare rough trade.)", "An occupation in the secondary sector, as opposed to an agricultural, professional or military one.", "Steady winds blowing from east to west above and below the equator.", "A publication intended for participants in an industry or related group of industries.", "Those who perform a particular kind of skilled work.", "The skilled practice of a practical occupation.", "Buying and selling of goods and services on a market.", "The business given to a commercial establishment by its customers.", "Instruments of any occupation."]}, {"pos": "verb", "definitions": ["To have dealings; to be concerned or associated (with).", "To be traded at a certain price or under certain conditions.", "To give (something) in exchange (for).", "To engage in trade.", "To use or exploit a particular aspect, such as a name, reputation, or image, to gain advantage or benefit.", "To give someone a plant and receive a different one in return.", "To recommend and get recommendations.", "To do business; offer for sale as for one's livelihood.", "To mutually exchange (something) (with)."]}, {"pos": "adj", "definitions": ["Of a product, produced for sale in the ordinary bulk retail trade and hence of only the most basic quality."]}], "ipa": "/tɹeɪd/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/7/76/En-uk-trade.ogg/En-uk-trade.ogg.mp3", "translations": ["comercio", "comerciar"], "difficulty": 0, "categories": ["work", "travel", "health"], "syllable_count": 2}, {"word": "verb", "definitions": [{"pos": "noun", "definitions": ["A word that indicates an action, event, or state of being.", "Any word; a vocable.", "A named command that performs a specific operation on an object.", "An action as opposed to a trait or thing."]}, {"pos": "verb", "definitions": ["To use any word that is or was not a verb (especially a noun) as if it were a verb.", "Used as a placeholder for any verb."]}], "ipa": "/vɜːb/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/4/40/En-us-verb.ogg/En-us-verb.ogg.mp3", "translations": ["verbo"], "difficulty": 0, "categories": ["work", "education", "travel"], "syllable_count": 1}, {"word": "adjective", "definitions": [{"pos": "noun", "definitions": ["A word that modifies a noun or noun phrase or describes a noun’s referent.", "A dependent; an accessory."]}, {"pos": "adj", "definitions": ["Applying to methods of enforcement and rules of procedure.", "Needing the use of a mordant to be made fast to that which is being dyed.", "Adjectival; pertaining to or functioning as an adjective.", "Incapable of independent function."]}, {"pos": "verb", "definitions": ["To characterize with an adjective; to describe by using an adjective.", "To make an adjective of; to form or convert into an adjective."]}], "ipa": "/ˈæd͡ʒ.ɪk.tɪv/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/f/f5/En-us-adjective.ogg/En-us-adjective.ogg.mp3", "translations": ["adjetivo", "adjetivo", "adjetivar"], "difficulty": 1, "categories": ["education", "work", "travel"], "syllable_count": 4}, {"word": "adjectival", "definitions": [{"pos": "adj", "definitions": ["Of or relating to procedure, especially to technicalities thereof.", "Of or relating to or functioning as an adjective."]}, {"pos": "noun", "definitions": ["An adjectival phrase or clause."]}], "ipa": "/ˌædʒɛkˈtaɪ.vəl/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/8/87/En-us-adjectival-main.flac/En-us-adjectival-main.flac.mp3", "translations": ["adjetival"], "difficulty": 2, "categories": ["work", "education", "travel"], "syllable_count": 4}, {"word": "substantive", "definitions": [{"pos": "adj", "definitions": ["Depending on itself; independent.", "Applying to essential legal principles and rules of right.", "Constituting the substance of content rather than its style, and thus always nontrivial.", "Of the essence or essential element of a thing.", "Not needing the use of a mordant to be made fast to that which is being dyed.", "Actually and legally held, as distinct from an acting, temporary or honorary rank or appointment", "Having substance; enduring; solid; firm; substantial.", "Of or pertaining to a substantive."]}, {"pos": "noun", "definitions": ["Part of a text that carries the meaning, such as words and their ordering.", "Ellipsis of noun substantive or substantive noun; a noun or a group of words (a noun phrase) that act as a noun (in a sentence)."]}, {"pos": "verb", "definitions": ["To make a word belonging to another part of speech into a substantive (that is, a noun) or use it as a noun."]}], "ipa": "/ˈsʌbstəntɪv/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/3/30/LL-Q1860_%28eng%29-Vealhurl-substantive.wav/LL-Q1860_%28eng%29-Vealhurl-substantive.wav.mp3", "translations": ["sustantivo"], "difficulty": 2, "categories": ["education", "health", "work"], "syllable_count": 4}, {"word": "trade wind", "definitions": [{"pos": "noun", "definitions": ["A steady wind that blows from east to west above and below the equator."]}], "ipa": "/ˈtɹeɪd ˈwɪnd/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/3/33/En-us-trade_wind.ogg/En-us-trade_wind.ogg.mp3", "translations": ["vientos alisios"], "difficulty": 1, "categories": ["travel", "work", "education"], "syllable_count": 3}, {"word": "patronage", "definitions": [{"pos": "noun", "definitions": ["Patronising speech or behaviour.", "Customers collectively; clientele; business.", "Guardianship, as of a saint; tutelary care.", "The act of providing approval and support; backing; championship.", "A communication that indicates lack of respect by patronizing the recipient; condescension; disdain.", "The right of nomination to political office.", "Granting favours or giving contracts or making appointments to office in return for political support.", "The right of presentation to church or ecclesiastical benefice; advowson.", "The act or state of being a customer of some business."]}, {"pos": "verb", "definitions": ["To be a regular customer or client of; to patronize", "To support by being a patron of."]}], "ipa": "/ˈpeɪtɹənɪd͡ʒ/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/1/17/LL-Q1860_%28eng%29-Vealhurl-patronage.wav/LL-Q1860_%28eng%29-Vealhurl-patronage.wav.mp3", "translations": ["patrocinio"], "difficulty": 1, "categories": ["health", "travel", "social life"], "syllable_count": 4}, {"word": "deal", "definitions": [{"pos": "noun", "definitions": ["An indefinite quantity or amount; a lot (now usually qualified by great or good).", "A division, a portion, a share, a part, a piece.", "A particular instance of trading (buying or selling; exchanging; bartering); a transaction.", "A situation, occasion, or event.", "An act of dealing or sharing out.", "A transaction offered which is financially beneficial; a bargain.", "A thing, an unspecified or unidentified object.", "An agreement between parties; an arrangement.", "A personality trait, especially a negative one, and the underlying cause of it.", "The distribution of cards to players; a player's turn for this.", "A wooden board or plank, usually between 12 or 14 feet in length, traded as a commodity in shipbuilding.", "Wood that is easy to saw (from conifers such as pine or fir).", "A plank of softwood (fir or pine board)."]}, {"pos": "verb", "definitions": ["To trade professionally (followed by in).", "To have dealings or business.", "To handle, to manage, to cope.", "To take action; to act.", "To conduct oneself, to behave.", "To distribute among a number of recipients, to give out as one’s portion or share.", "To administer or give out, as in small portions.", "To distribute cards to the players in a game.", "To pitch.", "To be concerned with.", "To sell, especially to sell illicit drugs.", "deliver damage, a blow, strike or cut. To inflict."]}, {"pos": "adj", "definitions": ["Made of deal."]}], "ipa": "/diːl/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/a/ad/En-us-deal.ogg/En-us-deal.ogg.mp3", "translations": ["reparto", "repartir", "reparto"], "difficulty": 0, "categories": ["work", "travel", "health"], "syllable_count": 1}, {"word": "merchandise", "definitions": [{"pos": "noun", "definitions": ["The act or business of trading; trade; traffic.", "A commodity offered for sale; an article of commerce; a kind of merchandise.", "Goods which are or were offered or intended for sale.", "Commercial goods connected (branded) with an entity such as a team, band, company, charity, work of fiction, festival, or meme. (Commonly shortened to merch.)"]}, {"pos": "verb", "definitions": ["To engage in in-store promotion of the sale of goods, as by display and arrangement of goods.", "To engage in the trade of.", "To engage in in-store promotion of the sale of.", "To engage in trade; to carry on commerce.", "To promote as if for sale."]}], "ipa": "/ˈmɜːt͡ʃəndaɪs/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/b/b4/En-us-merchandise.ogg/En-us-merchandise.ogg.mp3", "translations": ["mercancía"], "difficulty": 1, "categories": ["work", "health", "social life"], "syllable_count": 4}, {"word": "wares", "definitions": [{"pos": "noun", "definitions": ["plural of ware", "Goods or services that are for sale."]}], "ipa": "/wɛəz/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/a/a8/En-us-wears.ogg/En-us-wears.ogg.mp3", "translations": ["mercancías"], "difficulty": 0, "categories": ["education", "work", "health"], "syllable_count": 2}, {"word": "product", "definitions": [{"pos": "noun", "definitions": ["Anything that is produced; a result.", "A quantity obtained by multiplication of two or more numbers.", "Any tangible or intangible good or service that is a result of a process and that is intended for delivery to a customer or end user.", "A commodity offered for sale.", "Any preparation to be applied to the hair, skin, nails, etc. Often specifically a preparation used to hold one's hair in a desired arrangement.", "A chemical substance formed as a result of a chemical reaction.", "A consequence of someone's efforts or of a particular set of circumstances.", "The amount of an artifact that has been created by someone or some process.", "Any operation or a result thereof which generalises multiplication of numbers, like the multiplicative operation in a ring, product of types or a categorical product.", "Illegal drugs, especially cocaine, when viewed as a commodity."]}, {"pos": "verb", "definitions": ["To produce."]}], "ipa": "/ˈpɹɒd.əkt/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/1/1f/En-us-product.ogg/En-us-product.ogg.mp3", "translations": ["producto"], "difficulty": 0, "categories": ["work", "health", "education"], "syllable_count": 2}, {"word": "eagle", "definitions": [{"pos": "noun", "definitions": ["Any of several large carnivorous and carrion-eating birds in the family Accipitridae, having a powerful hooked bill and keen vision.", "A 13th-century coin minted in Europe and circulated in England as a debased sterling silver penny, outlawed under Edward I of England.", "A score of two under par for a hole.", "A gold coin with a face value of ten dollars, formerly used in the United States."]}, {"pos": "verb", "definitions": ["To score an eagle."]}], "ipa": "/ˈiːɡəl/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/8/86/LL-Q1860_%28eng%29-Vealhurl-eagle.wav/LL-Q1860_%28eng%29-Vealhurl-eagle.wav.mp3", "translations": ["águila"], "difficulty": 0, "categories": ["health", "travel", "work"], "syllable_count": 2}, {"word": "pneumonoultramicroscopicsilicovolcanoconiosis", "definitions": [{"pos": "noun", "definitions": ["A disease of the lungs, allegedly caused by inhaling microscopic silicate particles originating from the eruption of a volcano."]}], "ipa": "/ˌnjuːmə.nəʊ.ʌl.tɹə.maɪ.kɹəʊˌskɒ.pɪkˌsɪ.lɪ.kəʊ.vɒl.keɪ.nəʊ.kəʊ.niˈəʊ.sɪs/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/8/88/En-uk-pneumonoultramicroscopicsilicovolcanoconiosis.ogg/En-uk-pneumonoultramicroscopicsilicovolcanoconiosis.ogg.mp3", "translations": ["neumoconiosis"], "difficulty": 2, "categories": ["health", "work", "education"], "syllable_count": 17}, {"word": "head", "definitions": [{"pos": "noun", "definitions": ["A component.", "More generally, energy in a mass of fluid divided by its weight.", "The bow of a vessel.", "The place of honor or command; the most important or foremost position; the front.", "A person with an extensive knowledge of hip hop.", "The part of the body of an animal or human which contains the brain, mouth, and main sense organs.", "Topic; subject.", "Deposits near the top of a geological succession.", "Pressure and energy.", "The end of a rectangular table furthest from the entrance; traditionally considered a seat of honor.", "The source of a river; the end of a lake where a river flows into it.", "Power; armed force.", "The leafy top part of a tree.", "Tiles laid at the eaves of a house.", "The end of a pool table opposite the end where the balls have been racked.", "A clump of seeds, leaves or flowers; a capitulum.", "Fellatio or cunnilingus; oral sex.", "A title or heading in a book or other document.", "The glans penis.", "The principal melody or theme of a piece.", "The population of game.", "A beginning or end, a protuberance.", "The principal operative part of a machine or tool.", "A morpheme that determines the category of a compound or the word that determines the syntactic type of the phrase of which it is a member.", "A leader or expert.", "A machine element which reads or writes electromagnetic signals to or from a storage medium.", "A milling head, a part of a milling machine that houses the spindle.", "A headdress; a covering for the head.", "The end cap of a cask or other barrel.", "The end of an abscess where pus collects.", "A significant or important part.", "The difference in elevation between two points in a column of fluid, and the resulting pressure of the fluid at the lower point.", "A heavy or habitual user of illicit drugs.", "A drum head, the membrane which is hit to produce sound.", "A headteacher.", "The foam that forms on top of beer or other carbonated beverages.", "The cylinder head, a platform above the cylinders in an internal combustion engine, containing the valves and spark plugs.", "The end of a hammer, axe, golf club, or similar implement used for striking other objects.", "The top edge of a sail.", "Denouement; crisis.", "The end of a table.", "An ear of wheat, barley, or other small cereal.", "The antlers of a deer.", "The uppermost part of a valley.", "A leading component.", "A headland.", "An individual person.", "Mind; one's own thoughts.", "The rounded part of a bone fitting into a depression in another bone to form a ball-and-socket joint.", "The toilet of a ship.", "Headway; progress.", "The end cap of a cylindrically-shaped pressure vessel.", "A buildup of fluid pressure, often quantified as pressure head.", "To do with heads.", "A headache; especially one resulting from intoxication.", "The topmost, foremost, or leading part.", "The headstock of a guitar.", "Mental or emotional aptitude or skill.", "The part of a disk drive responsible for reading and writing data.", "Short for headline.", "The end of a nail, screw, bolt, or similar fastener which is opposite the point; usually blunt and relatively wide.", "The top part of a lacrosse stick that holds the ball.", "The sharp end of an arrow, spear, or pointer.", "A single animal; measure word for livestock and game."]}, {"pos": "adj", "definitions": ["Of, relating to, or intended for the head.", "Placed at the top or the front.", "Coming from in front.", "Foremost in rank or importance."]}, {"pos": "verb", "definitions": ["To come at the beginning or front of; to commence.", "To check or restrain.", "To originate; to spring; to have its course, as a river.", "To go in front of.", "To set on the head.", "To be in command of. (See also head up.)", "To behead; to decapitate.", "To get in the front of, so as to hinder or stop; to oppose.", "To form a head.", "To strike with the head", "To cut off the top of; to lop off.", "To move in a specified direction.", "To form a head (on or to); to fit or furnish (something) with a head.", "To remove the head from (a fish)."]}], "ipa": "/ˈhɛd/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/5/5c/En-us-head.ogg/En-us-head.ogg.mp3", "translations": ["cabeza", "capital", "encabezar"], "difficulty": 0, "categories": ["work", "education", "travel"], "syllable_count": 1}, {"word": "pumpkin", "definitions": [{"pos": "noun", "definitions": ["The color of the fruit of the pumpkin plant.", "Any of a number of cultivars from the genus Cucurbita; known in the US as winter squash.", "The round yellow or orange fruit of this plant.", "A domesticated plant, in species Cucurbita pepo, similar in growth pattern, foliage, flower, and fruit to the squash or melon.", "A term of endearment for someone small and cute."]}], "ipa": "/ˈpʌm(p).kɪn/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/f/fd/En-us-pumpkin.ogg/En-us-pumpkin.ogg.mp3", "translations": ["calabaza"], "difficulty": 0, "categories": ["health", "work", "education"], "syllable_count": 2}, {"word": "name", "definitions": [{"pos": "noun", "definitions": ["An abusive or insulting epithet.", "Those of a certain name; a race; a family.", "A reputation.", "An investor in Lloyd's of London bearing unlimited liability.", "Any nounal word or phrase which indicates a particular person, place, class, or thing.", "An authority; a behalf.", "A person (or legal person).", "A unique identifier, generally a string of characters.", "Any of several types of true yam (Dioscorea) used in Caribbean Spanish cooking."]}, {"pos": "verb", "definitions": ["To give a name to.", "To publicly implicate by name.", "To mention, specify.", "To designate for a role.", "To disclose the name of.", "To initiate a process to temporarily remove a member of parliament who is breaking the rules of conduct.", "To identify as relevant or important"]}], "ipa": "/neɪm/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/c/ce/En-us-name.ogg/En-us-name.ogg.mp3", "translations": ["nombre", "nombrar", "ñame"], "difficulty": 0, "categories": ["education", "work", "health"], "syllable_count": 1}, {"word": "fa", "definitions": [{"pos": "noun", "definitions": ["A syllable used in solfège to represent the fourth diatonic (or sixth chromatic) note of a major scale."]}, {"pos": "prep", "definitions": ["Alternative spelling of for"]}], "ipa": "/fɑ/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/f/fa/LL-Q1860_%28eng%29-Vealhurl-fa.wav/LL-Q1860_%28eng%29-Vealhurl-fa.wav.mp3", "translations": ["fa"], "difficulty": 0, "categories": ["travel", "education", "work"], "syllable_count": 1}, {"word": "Fabian", "definitions": [{"pos": "adj", "definitions": ["cautious; dilatory; avoiding a decisive contest.", "Advocating that social reforms be reached through a series of gradual and moderate stages rather than sudden revolution; specifically, relating to the Fabian Society, a British socialist society advocating reformist socialism.", "Pertaining to or reminiscent of Roman general Fabius Maximus, whose tactics against Hannibal during the Second Punic War famously consisted of delaying or avoiding combat, focusing instead on weakening the enemy by cutting off supply lines."]}, {"pos": "noun", "definitions": ["A Fabian socialist, a gradualist socialist; a member of the Fabian Society."]}, {"pos": "name", "definitions": ["A surname.", "A male given name from Latin."]}], "ipa": "/ˈfeɪbi.ən/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/2/2b/LL-Q1860_%28eng%29-Vealhurl-Fabian.wav/LL-Q1860_%28eng%29-Vealhurl-Fabian.wav.mp3", "translations": ["Fabián"], "difficulty": 0, "categories": ["work", "education", "travel"], "syllable_count": 2}, {"word": "fable", "definitions": [{"pos": "noun", "definitions": ["Fiction; untruth; falsehood.", "A fictitious narrative intended to enforce some useful truth or precept, usually with animals, etc. as characters; an apologue. Prototypically, Aesop's Fables.", "The plot, story, or connected series of events forming the subject of an epic or dramatic poem.", "Any story told to excite wonder; common talk; the theme of talk."]}, {"pos": "verb", "definitions": ["To make up; to devise, and speak of, as true or real; to tell of falsely; to recount in the form of a fable.", "To compose fables; hence, to write or speak fiction; to write or utter what is not true."]}], "ipa": "/ˈfeɪbəl/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/0/0c/En-us-fable.ogg/En-us-fable.ogg.mp3", "translations": ["fábula"], "difficulty": 0, "categories": ["social life", "work", "travel"], "syllable_count": 2}, {"word": "a-", "definitions": [{"pos": "prefix", "definitions": ["Forming verbs with the sense away, up, on, out.", "Forming verbs with the sense of intensified action.", "In, on, at; used to show a state, condition, or manner. Also passing into sense 2.", "In the direction of, or toward.", "In the act or process of. Used in some dialects before a present participle.", "At such a time.", "In, into. Also passing into sense 5.", "Alternative form of y- (archaic and dialectal) In dialect, it is sometimes conflated with sense 5 of the previous definition, and is used as a general indicator of a participle.", "Used to form the past participle of a verb.", "Forming words with the sense of wholly, or utterly out.", "Not, without, opposite of.", "Towards; Used to indicate direction, reduction to, increase to, change into, or motion.", "Away from.", "Of, from.", "Alternative form of -a (“empty syllable added to songs, poetry, verse and other speech”)", "Used as a prefix to verbs in the sense of remaining in the same condition. Actively doing something."]}], "ipa": "/ə/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/a/a6/En-us-a-%281%29.ogg/En-us-a-%281%29.ogg.mp3", "translations": ["a-"], "difficulty": 0, "categories": ["education", "work", "travel"], "syllable_count": 1}, {"word": "aardvark", "definitions": [{"pos": "noun", "definitions": ["The nocturnal, insectivorous primarily eating ants and termites, burrowing, mammal Orycteropus afer, of the order Tubulidentata, somewhat resembling a pig, common in some parts of sub-Saharan Africa."]}], "ipa": "/ˈɑːd.vɑːk/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/4/40/En-us-aardvark.ogg/En-us-aardvark.ogg.mp3", "translations": ["cerdo hormiguero"], "difficulty": 0, "categories": ["health", "work", "travel"], "syllable_count": 2}, {"word": "aardwolf", "definitions": [{"pos": "noun", "definitions": ["A nocturnal, insectivorous mammal, Proteles cristatus, of southern and eastern Africa, related to and resembling the hyena."]}], "ipa": "/ˈɑːdˌwʊlf/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/a/af/LL-Q1860_%28eng%29-Vealhurl-aardwolf.wav/LL-Q1860_%28eng%29-Vealhurl-aardwolf.wav.mp3", "translations": ["lobo de tierra"], "difficulty": 1, "categories": ["health", "travel", "work"], "syllable_count": 2}, {"word": "Aaronic", "definitions": [{"pos": "adj", "definitions": ["Pertaining to Aaron (elder brother of Moses).", "Of or pertaining to the lower order of priests.", "Pertaining to or characteristic of a high priest; priestly."]}], "ipa": "/æɹˈɒn.ɪk/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/8/83/En-us-Aaronic.ogg/En-us-Aaronic.ogg.mp3", "translations": ["aarónico"], "difficulty": 1, "categories": ["health", "travel", "work"], "syllable_count": 3}, {"word": "abaca", "definitions": [{"pos": "noun", "definitions": ["Musa textilis, a species of banana tree native to the Philippines grown for its textile, rope- and papermaking fibre.", "The fiber of this plant, used in rope, fibers, and cloth."]}], "ipa": "/ˈæb.əˌkɑː/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/2/2e/LL-Q1860_%28eng%29-Vininn126-abaca.wav/LL-Q1860_%28eng%29-Vininn126-abaca.wav.mp3", "translations": ["abacá"], "difficulty": 1, "categories": ["health", "travel", "education"], "syllable_count": 3}, {"word": "abacist", "definitions": [{"pos": "noun", "definitions": ["One who uses an abacus in casting accounts; a calculator."]}], "ipa": "/ˈæb.ə.sɪst/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/b/b4/En-us-abacist.ogg/En-us-abacist.ogg.mp3", "translations": ["abacista"], "difficulty": 1, "categories": ["work", "health", "travel"], "syllable_count": 3}, {"word": "aback", "definitions": [{"pos": "adv", "definitions": ["By surprise; startled; dumbfounded. (see usage)", "Towards the back or rear; backwards.", "In the rear; a distance behind.", "Backward against the mast; said of the sails when pressed by the wind from the \"wrong\" (forward) side, or of a ship when its sails are set that way."]}, {"pos": "noun", "definitions": ["An inscribed stone square."]}], "ipa": "/əˈbæk/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/2/2a/En-us-aback.ogg/En-us-aback.ogg.mp3", "translations": ["atrás"], "difficulty": 0, "categories": ["work", "education", "health"], "syllable_count": 2}, {"word": "abaculus", "definitions": [{"pos": "noun", "definitions": ["A small tile of glass, marble, or other substance, of various colors, used in making ornamental patterns in mosaic pavements; abaciscus."]}], "ipa": "/əˈbæk.jə.ləs/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/a/af/En-us-abaculus.ogg/En-us-abaculus.ogg.mp3", "translations": ["abáculo"], "difficulty": 2, "categories": ["work", "education", "travel"], "syllable_count": 4}, {"word": "abacus", "definitions": [{"pos": "noun", "definitions": ["A device used for performing arithmetical calculations; (rare) a table on which loose counters are placed, or (more commonly) an instrument with beads sliding on rods, or counters in grooves, with one row of beads or counters representing units, the next tens, etc.", "The uppermost portion of the capital of a column immediately under the architrave, in some cases a flat oblong or square slab, in others more decorated.", "A board, tray, or table, divided into perforated compartments for holding bottles, cups, or the like; a kind of buffet, cupboard, or sideboard.", "A table or tray scattered with sand which was used for calculating or drawing."]}], "ipa": "/ˈæbəkəs/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/b/ba/En-us-abacus.ogg/En-us-abacus.ogg.mp3", "translations": ["ábaco"], "difficulty": 1, "categories": ["work", "education", "health"], "syllable_count": 3}, {"word": "Abaddon", "definitions": [{"pos": "name", "definitions": ["Hell; the bottomless pit; a place of destruction.", "The destroyer, or angel of the bottomless pit; Apollyon;"]}], "ipa": "/əˈbæ.dn̩/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/9/94/LL-Q1860_%28eng%29-Vealhurl-Abaddon.wav/LL-Q1860_%28eng%29-Vealhurl-Abaddon.wav.mp3", "translations": ["Abadón"], "difficulty": 1, "categories": ["health", "work", "education"], "syllable_count": 3}, {"word": "abaft", "definitions": [{"pos": "prep", "definitions": ["Behind; toward the stern relative to some other object or position; aft of."]}, {"pos": "adv", "definitions": ["Backwards.", "On the aft side; in the stern."]}], "ipa": "/əˈbɑːft/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/0/0f/En-us-abaft.ogg/En-us-abaft.ogg.mp3", "translations": ["a popa", "a popa"], "difficulty": 0, "categories": ["travel", "work", "health"], "syllable_count": 2}, {"word": "abalone", "definitions": [{"pos": "noun", "definitions": ["An edible univalve mollusc of the genus Haliotis, having a shell lined with mother-of-pearl.", "The meat of the aforementioned mollusc."]}], "ipa": "/æb.əˈləʊ.ni/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/e/e4/En-us-abalone.ogg/En-us-abalone.ogg.mp3", "translations": ["oreja de mar"], "difficulty": 1, "categories": ["health", "work", "travel"], "syllable_count": 4}, {"word": "abandon", "definitions": [{"pos": "verb", "definitions": ["To give up or relinquish control of, to surrender or to give oneself over, or to yield to one's emotions.", "To cast out; to banish; to expel; to reject.", "To leave behind; to desert, as in a ship, a position, or a person, typically in response to overwhelming odds or impending dangers; to forsake, in spite of a duty or responsibility.", "To desist in doing, practicing, following, holding, or adhering to; to turn away from; to permit to lapse; to renounce; to discontinue.", "To surrender to the insurer (an insured item), so as to claim a total loss.", "To no longer exercise a right, title, or interest, especially with no interest of reclaiming it again; to yield; to relinquish.", "To subdue; to take control of."]}, {"pos": "noun", "definitions": ["A yielding to natural impulses or inhibitions; freedom from artificial constraint, with loss of appreciation of consequences. (Now especially in the phrase with abandon.)", "Abandonment; relinquishment."]}], "ipa": "/əˈbæn.dən/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/d/dd/En-us-abandon.ogg/En-us-abandon.ogg.mp3", "translations": ["renunciar", "desenfreno"], "difficulty": 1, "categories": ["work", "travel", "health"], "syllable_count": 3}, {"word": "abandoned", "definitions": [{"pos": "adj", "definitions": ["Free from constraint; uninhibited.", "No longer being acted upon by the geologic forces that formed it.", "Having given oneself up to vice; immoral; extremely wicked, or sinning without restraint; irreclaimably wicked.", "No longer maintained by its former owners, residents, or caretakers; forsaken, deserted."]}, {"pos": "verb", "definitions": ["simple past and past participle of abandon"]}], "ipa": "/əˈbæn.dənd/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/3/3d/En-us-abandoned.ogg/En-us-abandoned.ogg.mp3", "translations": ["desenfrenado"], "difficulty": 1, "categories": ["work", "travel", "health"], "syllable_count": 4}, {"word": "abandoner", "definitions": [{"pos": "noun", "definitions": ["One who abandons."]}], "ipa": "/əˈbændənɚ/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/2/29/LL-Q1860_%28eng%29-Vanderdecken-abandoner.wav/LL-Q1860_%28eng%29-Vanderdecken-abandoner.wav.mp3", "translations": ["abandonador"], "difficulty": 2, "categories": ["work", "travel", "health"], "syllable_count": 4}, {"word": "abandonment", "definitions": [{"pos": "noun", "definitions": ["The act of abandoning, or the state of being abandoned; total desertion; relinquishment.", "Abandon; careless freedom or ease; surrender to one's emotions.", "The cessation of service on a particular segment of the lines of a common carrier, as granted by a government agency.", "An abandoned building or structure.", "The self-surrender to an outside influence.", "The relinquishment of a right, claim, or privilege; relinquishment of right to secure a patent by an inventor; relinquishment of copyright by an author.", "The voluntary leaving of a person to whom one is bound by a special relation, as a wife, husband or child; desertion.", "The relinquishment by the insured to the underwriters of what may remain of the property insured after a loss or damage by a peril insured against.", "A refusal to receive freight so damaged in transit as to be worthless and render carrier liable for its value."]}], "ipa": "/əˈbæn.dn̩.mn̩t/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/0/0e/En-us-abandonment.ogg/En-us-abandonment.ogg.mp3", "translations": ["abandono"], "difficulty": 2, "categories": ["work", "travel", "health"], "syllable_count": 4}, {"word": "abase", "definitions": [{"pos": "verb", "definitions": ["To lower physically; to depress; to cast or throw down; to stoop.", "To lower, as in condition in life, office, rank, etc., so as to cause pain or hurt feelings; to degrade, to depress, to humble, to humiliate.", "To lower in value, in particular by altering the content of alloys in coins; to debase."]}], "ipa": "/əˈbeɪs/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/6/60/En-us-abase.ogg/En-us-abase.ogg.mp3", "translations": ["rebajar"], "difficulty": 1, "categories": ["health", "work", "travel"], "syllable_count": 3}, {"word": "abasement", "definitions": [{"pos": "noun", "definitions": ["The state of being abased or humbled; humiliation.", "The act of abasing, humbling, or bringing low."]}], "ipa": "/əˈbeɪs.mənt/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/9/99/En-us-abasement.ogg/En-us-abasement.ogg.mp3", "translations": ["rebajamiento"], "difficulty": 2, "categories": ["work", "health", "travel"], "syllable_count": 4}, {"word": "abash", "definitions": [{"pos": "verb", "definitions": ["To make ashamed; to embarrass; to destroy the self-possession of, as by exciting suddenly a consciousness of guilt, mistake, or inferiority; to disconcert; to discomfit.", "To lose self-possession; to become ashamed."]}], "ipa": "/əˈbæʃ/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/b/ba/En-us-abash.ogg/En-us-abash.ogg.mp3", "translations": ["confundir"], "difficulty": 0, "categories": ["health", "work", "education"], "syllable_count": 2}, {"word": "abate", "definitions": [{"pos": "verb", "definitions": ["To bow down; hence, to be abased or humbled.", "To give a discount or rebate; to discount, to rebate.", "To demolish or level to the ground (a building or other structure).", "To lessen (something) in force or intensity; to moderate.", "Of an edge, point, etc.: to become blunt or dull.", "Chiefly followed by of: to deprive (someone or something of another thing).", "To decrease in amount or size.", "To make (a writ or other legal document) void; to nullify.", "Of legal proceedings: to be dismissed or otherwise brought to an end before they are completed, especially on procedural grounds rather than on the merits.", "To dull (an edge, point, etc.); to blunt.", "To curtail or end (something); to cause to cease.", "To give (someone) a discount or rebate; also, to relieve (someone) of a debt.", "To dismiss or otherwise bring to an end (legal proceedings) before they are completed, especially on procedural grounds rather than on the merits.", "To give no consideration to (something); to treat as an exception.", "Of a writ or other legal document: to become null and void; to cease to have effect.", "To bring down (someone) mentally or physically; to lower (someone) in status.", "To cut away or hammer down (material from metalwork, a sculpture, etc.) in such a way as to leave a figure in relief.", "To decrease in force or intensity; to subside.", "To put an end to (a nuisance).", "To reduce (something) in amount or size.", "Chiefly followed by of: to deduct or subtract from.", "To lower in price or value; (law) specifically, of a bequest in a will: to lower in value because the testator's estate is insufficient to satisfy all the bequests in full.", "To lower (something) in price or value.", "Chiefly followed by from, of, etc.: to omit or remove (a part from a whole); to deduct, to subtract.", "To enter upon and unlawfully seize (land) after the owner has died, thus preventing an heir from taking possession of it."]}, {"pos": "noun", "definitions": ["Abatement; reduction; (countable) an instance of this.", "Deduction; subtraction; (countable) an instance of this.", "An Italian abbot or other member of the clergy."]}], "ipa": "/əˈbeɪt/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/e/ed/En-us-abate.oga/En-us-abate.oga.mp3", "translations": ["reducir"], "difficulty": 1, "categories": ["health", "education", "travel"], "syllable_count": 3}, {"word": "abatement", "definitions": [{"pos": "noun", "definitions": ["A mark of dishonor on an escutcheon; any figure added to the coat of arms tending to lower the dignity or station of the bearer.", "The reduction of the proceeds of a will, when the debts have not yet been satisfied; the reduction of taxes due.", "The action of a person that abates, or without proper authority enters a residence after the death of the owner and before the heir takes possession.", "An amount abated; that which is taken away by way of reduction; deduction; decrease; a rebate or discount allowed; in particular from a tax.", "A quashing, a judicial defeat, the rendering abortive by law.", "Waste of stuff in preparing to size.", "Forcible entry of a stranger into an inheritance when the person seised of it dies, and before the heir or devisee can take possession; ouster.", "The act of abating, or the state of being abated; a lessening, diminution, or reduction; a moderation; removal or putting an end to; the suppression.", "A beating down, a putting down.", "rebatement, real or imaginary marks of disgrace affixed to an escutcheon.", "The deduction of minor revenues incidental to an operation in calculating the cost of the operation."]}], "ipa": "/əˈbeɪt.mənt/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/2/2f/En-us-abatement.ogg/En-us-abatement.ogg.mp3", "translations": ["disminución"], "difficulty": 1, "categories": ["health", "work", "education"], "syllable_count": 4}, {"word": "abattoir", "definitions": [{"pos": "noun", "definitions": ["A place or event likened to a slaughterhouse, because of great carnage or bloodshed.", "A public slaughterhouse for cattle, sheep, etc."]}], "ipa": "/ˈæb.əˌtwɑː(ɹ)/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/a/a3/En-us-abattoir.ogg/En-us-abattoir.ogg.mp3", "translations": ["matadero"], "difficulty": 1, "categories": ["work", "health", "travel"], "syllable_count": 3}, {"word": "abbatial", "definitions": [{"pos": "adj", "definitions": ["Belonging to, relating to, or pertaining to an abbey, abbot, or abbess."]}], "ipa": "/əˈbeɪ.ʃl̩/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/f/f7/LL-Q1860_%28eng%29-Vealhurl-abbatial.wav/LL-Q1860_%28eng%29-Vealhurl-abbatial.wav.mp3", "translations": ["abacial"], "difficulty": 1, "categories": ["travel", "education", "health"], "syllable_count": 3}, {"word": "abbess", "definitions": [{"pos": "noun", "definitions": ["A female superior or governess of a nunnery, or convent of nuns, having the same authority over the nuns which the abbots have over the monks.", "A woman who runs a brothel; a woman employed by a prostitute to find clients."]}], "ipa": "/ˈæb.ɪs/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/8/86/En-us-abbess.ogg/En-us-abbess.ogg.mp3", "translations": ["abadesa"], "difficulty": 0, "categories": ["education", "health", "work"], "syllable_count": 2}, {"word": "abbey", "definitions": [{"pos": "noun", "definitions": ["The church of a monastery.", "The office or dominion of an abbot or abbess.", "A monastery or society of people, secluded from the world and devoted to religion and celibacy, which is headed by an abbot or abbess; also, the monastic building or buildings.", "A residence that was previously an abbatial building."]}], "ipa": "/ˈæb.i/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/0/07/En-us-abbey.ogg/En-us-abbey.ogg.mp3", "translations": ["abadía"], "difficulty": 0, "categories": ["education", "work", "health"], "syllable_count": 2}, {"word": "abbot", "definitions": [{"pos": "noun", "definitions": ["The superior or head of an abbey or monastery.", "The pastor or administrator of an order, including minor and major orders starting with the minor order of porter.", "A ponce; a man employed by a prostitute to find clients, and who may also act as a bodyguard or equivalent to a bouncer.", "A layman who received the abbey's revenues, after the closing of the monasteries.", "A brothel-owner's husband or lover."]}], "ipa": "/ˈæb.ət/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/7/72/En-us-abbot.ogg/En-us-abbot.ogg.mp3", "translations": ["abad"], "difficulty": 0, "categories": ["education", "travel", "health"], "syllable_count": 2}, {"word": "abbreviate", "definitions": [{"pos": "verb", "definitions": ["To shorten by omitting parts or details.", "To reduce to lower terms, as a fraction.", "To reduce a word or phrase by means of contraction or omission to a shorter recognizable form.", "To speak or write in a brief manner.", "To make shorter; to shorten (in time); to abridge; to shorten by ending sooner than planned."]}, {"pos": "adj", "definitions": ["Having one part relatively shorter than another or than the ordinary type.", "Abbreviated.", "Abbreviated, abridged, shortened."]}, {"pos": "noun", "definitions": ["An abridgment."]}], "ipa": "/əˈbɹiː.vi.eɪt/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/2/21/En-us-abbreviate.ogg/En-us-abbreviate.ogg.mp3", "translations": ["abreviar"], "difficulty": 1, "categories": ["education", "work", "health"], "syllable_count": 4}, {"word": "abbreviated", "definitions": [{"pos": "adj", "definitions": ["Relatively short; shorter than normal, or compared to others.", "Shortened; made briefer.", "Scanty, as in clothing."]}, {"pos": "verb", "definitions": ["simple past and past participle of abbreviate"]}], "ipa": "/əˈbɹiːvieɪtɪd/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/0/07/En-us-abbreviated.ogg/En-us-abbreviated.ogg.mp3", "translations": ["abreviado"], "difficulty": 2, "categories": ["education", "work", "travel"], "syllable_count": 4}, {"word": "abbreviation", "definitions": [{"pos": "noun", "definitions": ["Loss during evolution of the final stages of the ancestral ontogenetic pattern.", "The process of abbreviating.", "A notation used in music score to denote a direction, as pp or mf.", "The result of shortening or reducing; abridgment.", "A shortened or contracted form of a word or phrase used to represent the whole, using omission of letters, and sometimes substitution of letters, or duplication of initial letters to signify plurality, including signs such as +, =, @.", "Any convenient short form used as a substitution for an understood or inferred whole.", "One or more dashes through the stem of a note, dividing it respectively into quavers, semiquavers, demisemiquavers, or hemidemisemiquavers.", "Reduction to lower terms, as a fraction."]}], "ipa": "/əˌbɹiː.viˈeɪ.ʃən/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/f/fa/LL-Q1860_%28eng%29-Vealhurl-abbreviation.wav/LL-Q1860_%28eng%29-Vealhurl-abbreviation.wav.mp3", "translations": ["abreviación"], "difficulty": 2, "categories": ["travel", "health", "education"], "syllable_count": 4}, {"word": "abbreviature", "definitions": [{"pos": "noun", "definitions": ["The process of abbreviating.", "An abbreviated state or form.", "An abridgment; a compendium; an abstract.", "A shortened form of a word or phrase, used in place of the whole; an abbreviation."]}], "ipa": "/əˈbɹi.vi.əˌt͡ʃʊɹ/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/6/68/LL-Q1860_%28eng%29-Vealhurl-abbreviature.wav/LL-Q1860_%28eng%29-Vealhurl-abbreviature.wav.mp3", "translations": ["abreviatura"], "difficulty": 2, "categories": ["education", "work", "travel"], "syllable_count": 5}, {"word": "abdicate", "definitions": [{"pos": "verb", "definitions": ["To reject; to cast off; to discard.", "To relinquish or renounce a throne, or other high office or dignity; to renounce sovereignty.", "To surrender, renounce or relinquish, as sovereign power; to withdraw definitely from filling or exercising, as a high office, station, dignity; to fail to fulfill responsibility for.", "To disclaim and expel from the family, as a father his child; to disown; to disinherit.", "To depose.", "To formally separate oneself from or to divest oneself of."]}], "ipa": "/ˈæb.dɪˌkeɪt/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/2/21/En-ca-abdicate.ogg/En-ca-abdicate.ogg.mp3", "translations": ["abdicar"], "difficulty": 1, "categories": ["travel", "work", "health"], "syllable_count": 4}, {"word": "abdication", "definitions": [{"pos": "noun", "definitions": ["The act of abdicating; the renunciation of a high office, dignity, or trust, by its holder.", "The voluntary renunciation of sovereign power.", "The renunciation of interest in a property or a legal claim; abandonment.", "The action of being deposed from the seat of power.", "The act of disowning or disinheriting a child."]}], "ipa": "/ˌæb.dəˈkeɪ.ʃən/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/6/62/En-us-abdication.ogg/En-us-abdication.ogg.mp3", "translations": ["abdicación"], "difficulty": 2, "categories": ["work", "travel", "health"], "syllable_count": 4}, {"word": "abdomen", "definitions": [{"pos": "noun", "definitions": ["The cavity of the belly, which is lined by the peritoneum, and contains the viscera; often restricted in humans to the part between the diaphragm and the commencement of the pelvis, the remainder being called the pelvic cavity.", "The posterior section of the body, behind the thorax, in insects, crustaceans, and other Arthropoda.", "The belly, or that part of the body between the thorax and the pelvis, not including the back; or in some lower vertebrates, the portion between the cardiac and caudal regions.", "The fat surrounding the belly."]}], "ipa": "/ˈæb.də.mən/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/0/05/En-us-abdomen.ogg/En-us-abdomen.ogg.mp3", "translations": ["abdomen"], "difficulty": 1, "categories": ["health", "work", "education"], "syllable_count": 3}, {"word": "abdominal", "definitions": [{"pos": "adj", "definitions": ["Ventral, in describing a fin.", "Having the ventral fins under the abdomen and behind the pectoral fins.", "Of or pertaining to the abdomen; ventral.", "Belonging to the order Abdominales of fish."]}, {"pos": "noun", "definitions": ["An abdominal muscle.", "A fish of the order Abdominales."]}], "ipa": "/æbˈdɒm.ə.nl̩/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/1/14/En-us-abdominal.ogg/En-us-abdominal.ogg.mp3", "translations": ["abdominal"], "difficulty": 1, "categories": ["health", "work", "education"], "syllable_count": 4}, {"word": "abduce", "definitions": [{"pos": "verb", "definitions": ["To draw a conclusion, especially in metanalysis; to deduce.", "To draw; to conduct away; to take away; to withdraw; to draw to a different part; to move a limb out away from the center of the body; abduct."]}], "ipa": "/əbˈdjuːs/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/5/59/LL-Q1860_%28eng%29-Vealhurl-abduce.wav/LL-Q1860_%28eng%29-Vealhurl-abduce.wav.mp3", "translations": ["abducir"], "difficulty": 1, "categories": ["work", "health", "education"], "syllable_count": 3}, {"word": "abduct", "definitions": [{"pos": "verb", "definitions": ["To take away by force; to carry away (a human being) wrongfully and usually with violence or deception; to kidnap.", "To draw away, as a limb or other part, from the median axis of the body."]}], "ipa": "/æbˈdʌkt/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/1/10/En-ca-abduct.ogg/En-ca-abduct.ogg.mp3", "translations": ["raptar"], "difficulty": 0, "categories": ["work", "travel", "health"], "syllable_count": 2}, {"word": "abduction", "definitions": [{"pos": "noun", "definitions": ["The wrongful, and usually forcible, carrying off of a human being.", "The act of abducing or abducting; a drawing apart; the movement which separates a limb or other part from the axis, or middle line, of the body.", "Leading away; a carrying away.", "Alien abduction.", "A syllogism or form of argument in which the major premise is evident, but the minor is only probable."]}], "ipa": "/əbˈdʌk.ʃn̩/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/b/b4/LL-Q1860_%28eng%29-Vealhurl-abduction.wav/LL-Q1860_%28eng%29-Vealhurl-abduction.wav.mp3", "translations": ["rapto"], "difficulty": 1, "categories": ["health", "work", "travel"], "syllable_count": 3}, {"word": "abductor", "definitions": [{"pos": "noun", "definitions": ["One who abducts; a kidnapper.", "A muscle which serves to draw a part out, or from the median line of the body"]}], "ipa": "/æbˈdʌk.tɚ/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/f/f7/En-ca-abductor.ogg/En-ca-abductor.ogg.mp3", "translations": ["raptor", "abductor"], "difficulty": 1, "categories": ["work", "travel", "health"], "syllable_count": 3}, {"word": "abecedary", "definitions": [{"pos": "noun", "definitions": ["One that teaches or learns the alphabet or the fundamentals of any subject; abecedarian.", "The alphabet, written out in a teaching book, or carved on a wall; a primer; abecedarium."]}, {"pos": "adj", "definitions": ["Referring to the alphabet; alphabetical; related to or resembling an abecedarius; abecedarian."]}], "ipa": "/ˌeɪ.biːˈsiː.də.ɹi/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/6/6d/LL-Q1860_%28eng%29-Vealhurl-abecedary.wav/LL-Q1860_%28eng%29-Vealhurl-abecedary.wav.mp3", "translations": ["abecedario"], "difficulty": 2, "categories": ["work", "health", "education"], "syllable_count": 5}, {"word": "abed", "definitions": [{"pos": "adv", "definitions": ["To childbed", "In bed, or on the bed; confined to bed."]}], "ipa": "/əˈbɛd/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/f/fa/LL-Q1860_%28eng%29-Vealhurl-abed.wav/LL-Q1860_%28eng%29-Vealhurl-abed.wav.mp3", "translations": ["en cama"], "difficulty": 0, "categories": ["education", "work", "health"], "syllable_count": 2}, {"word": "abelian", "definitions": [{"pos": "adj", "definitions": ["Of a binary function, commutative.", "Of an algebraic structure (usually a group or algebra), having a commutative defining operation."]}], "ipa": "/əˈbi.li.ən/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/7/7d/LL-Q1860_%28eng%29-Vealhurl-abelian.wav/LL-Q1860_%28eng%29-Vealhurl-abelian.wav.mp3", "translations": ["abeliano"], "difficulty": 1, "categories": ["education", "health", "work"], "syllable_count": 3}, {"word": "abelmosk", "definitions": [{"pos": "noun", "definitions": ["The edible and aromatic seed pods (properly, capsules) of the Abelmoschus moschatus.", "Other members of the genus Abelmoschus, such as okra.", "The tropical evergreen shrub Abelmoschus moschatus itself."]}], "ipa": "/ˈeɪbəlmɒsk/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/d/d1/En-ca-abelmosk.ogg/En-ca-abelmosk.ogg.mp3", "translations": ["abelmosco"], "difficulty": 1, "categories": ["travel", "education", "health"], "syllable_count": 3}, {"word": "aberrance", "definitions": [{"pos": "noun", "definitions": ["State of being aberrant; a wandering from the right way; deviation from truth, rectitude."]}], "ipa": "/ˈæ.bɛɹ.n̩s/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/5/5e/En-us-aberrance.ogg/En-us-aberrance.ogg.mp3", "translations": ["aberración"], "difficulty": 2, "categories": ["travel", "work", "health"], "syllable_count": 4}, {"word": "aberrant", "definitions": [{"pos": "adj", "definitions": ["Straying from the right way; deviating from morality or truth.", "Deviating from the ordinary or natural type; exceptional; abnormal.", "Differing from the norm."]}, {"pos": "noun", "definitions": ["A group, individual, or structure that deviates from the usual or natural type, especially with an atypical chromosome number.", "A person or object that deviates from the rest of a group."]}], "ipa": "/əˈbɛɹ.ənt/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/5/52/LL-Q1860_%28eng%29-Vealhurl-aberrant.wav/LL-Q1860_%28eng%29-Vealhurl-aberrant.wav.mp3", "translations": ["aberrante"], "difficulty": 1, "categories": ["work", "travel", "health"], "syllable_count": 3}, {"word": "aberration", "definitions": [{"pos": "noun", "definitions": ["A deviation of a tissue, organ or mental functions from what is considered to be within the normal range.", "The act of wandering; deviation from truth, moral rectitude; abnormal; divergence from the straight, correct, proper, normal, or from the natural state.", "The convergence to different foci, by a lens or mirror, of rays of light emanating from one and the same point, or the deviation of such rays from a single focus; a defect in a focusing mechanism that prevents the intended focal point.", "The tendency of light rays to preferentially strike the leading face of a moving object (the effect underlying the above phenomenon).", "A partial alienation of reason.", "Any creature with supernatural powers not found in the organized classes of beings in a given setting.", "A defect in an image produced by an optical or electrostatic lens system.", "A mental disorder, especially one of a minor or temporary character.", "Atypical development or structure; deviation from the normal type; an aberrant organ.", "A small periodical change of the apparent positions of the stars and other heavenly bodies, due to the combined effect of the motion of light and the motion of the observer."]}], "ipa": "/ˌæb.əˈɹeɪ.ʃn̩/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/7/76/En-us-aberration.ogg/En-us-aberration.ogg.mp3", "translations": ["aberración"], "difficulty": 1, "categories": ["health", "work", "travel"], "syllable_count": 4}, {"word": "abet", "definitions": [{"pos": "verb", "definitions": ["To support, countenance, maintain, uphold, or aid (any good cause, opinion, or action).", "To incite; to assist or encourage by aid or countenance in crime.", "To urge on, stimulate (a person to do) something desirable.", "To back up one's forecast of a doubtful issue, by staking money, etc., to bet."]}, {"pos": "noun", "definitions": ["Fraud or cunning.", "An act of abetting; of helping; of giving aid."]}], "ipa": "/əˈbɛt/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/8/8f/En-ca-abet.ogg/En-ca-abet.ogg.mp3", "translations": ["incitar"], "difficulty": 0, "categories": ["travel", "education", "work"], "syllable_count": 2}, {"word": "abeyance", "definitions": [{"pos": "noun", "definitions": ["Suspension; temporary suppression; dormant condition.", "Expectancy of a noble or armigeral title, its right in existence but its exercise suspended.", "Expectancy; a condition when an ownership of real property is undetermined; lapse in succession of ownership of estate, or title."]}], "ipa": "/əˈbeɪ.əns/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/9/9e/LL-Q1860_%28eng%29-Arlo_Barnes-abeyance.wav/LL-Q1860_%28eng%29-Arlo_Barnes-abeyance.wav.mp3", "translations": ["expectativa"], "difficulty": 1, "categories": ["daily life", "health", "work"], "syllable_count": 3}, {"word": "abhor", "definitions": [{"pos": "verb", "definitions": ["To fill with horror or disgust.", "To feel horror, disgust, or dislike (towards); to be contrary or averse (to); construed with from.", "To protest against; to reject solemnly.", "To regard (someone or something) as horrifying or detestable; to feel great repugnance toward.", "Differ entirely from.", "To turn aside or avoid; to keep away from; to reject."]}], "ipa": "/əbˈhɔː/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/5/5f/En-uk-abhor.ogg/En-uk-abhor.ogg.mp3", "translations": ["aborrecer"], "difficulty": 0, "categories": ["work", "health", "travel"], "syllable_count": 2}, {"word": "abhorrence", "definitions": [{"pos": "noun", "definitions": ["Extreme aversion or detestation; the feeling of utter dislike or loathing.", "An expression of abhorrence, in particular any of the parliamentary addresses dictated towards Charles II.", "A person or thing that is loathsome; a detested thing."]}], "ipa": "/əbˈhɒɹ.n̩(t)s/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/b/b1/En-us-abhorrence.ogg/En-us-abhorrence.ogg.mp3", "translations": ["aborrecimiento"], "difficulty": 1, "categories": ["work", "health", "travel"], "syllable_count": 4}, {"word": "abhorrent", "definitions": [{"pos": "adj", "definitions": ["Inconsistent with, or far removed from, something; strongly opposed.", "Contrary to something; discordant.", "Detestable or repugnant.", "Abhorring; detesting; having or showing abhorrence; loathing."]}], "ipa": "/æbˈ(h)ɒɹ.ənt/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/f/f5/LL-Q1860_%28eng%29-Vealhurl-abhorrent.wav/LL-Q1860_%28eng%29-Vealhurl-abhorrent.wav.mp3", "translations": ["repugnante"], "difficulty": 1, "categories": ["work", "travel", "health"], "syllable_count": 3}, {"word": "abide", "definitions": [{"pos": "verb", "definitions": ["To endure or undergo a hard trial or a task; to stand up under.", "To endure without yielding; to withstand.", "To stand ready for; to await for someone; watch for.", "To bear patiently.", "Used in a phrasal verb: abide by (“to accept and act in accordance with”).", "To wait in expectation.", "To stay; to continue in a place; to remain stable or fixed in some state or condition; to be left.", "To have one's abode.", "To await submissively; accept without question; submit to.", "To pay for; to stand the consequences of.", "To endure; to remain; to last.", "To pause; to delay."]}], "ipa": "/əˈbaɪd/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/b/b6/En-us-abide.ogg/En-us-abide.ogg.mp3", "translations": ["quedar"], "difficulty": 0, "categories": ["education", "work", "health"], "syllable_count": 3}, {"word": "abigail", "definitions": [{"pos": "noun", "definitions": ["A lady's maid."]}], "ipa": "/ˈa.bɪ.ɡeɪl/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/c/c6/LL-Q1860_%28eng%29-Vealhurl-abigail.wav/LL-Q1860_%28eng%29-Vealhurl-abigail.wav.mp3", "translations": ["doncella"], "difficulty": 1, "categories": ["work", "education", "health"], "syllable_count": 3}, {"word": "ability", "definitions": [{"pos": "noun", "definitions": ["A skill or competence in doing; mental power; talent; aptitude.", "Physical power.", "The legal wherewithal to act.", "Financial ability.", "A unique power of the mind; a faculty.", "Suitableness.", "The quality or state of being able; capacity to do or of doing something; having the necessary power."]}], "ipa": "/əˈbɪl.ə.ti/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/6/66/En-us-ability.ogg/En-us-ability.ogg.mp3", "translations": ["habilidad"], "difficulty": 1, "categories": ["travel", "health", "education"], "syllable_count": 4}, {"word": "abiogenesis", "definitions": [{"pos": "noun", "definitions": ["The origination of living organisms from lifeless matter; such genesis as does not involve the action of living parents."]}], "ipa": "/ˌeɪbaɪəʊˈdʒɛnəsɪs/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/7/72/LL-Q1860_%28eng%29-Vininn126-abiogenesis.wav/LL-Q1860_%28eng%29-Vininn126-abiogenesis.wav.mp3", "translations": ["abiogénesis"], "difficulty": 2, "categories": ["health", "education", "work"], "syllable_count": 5}, {"word": "abject", "definitions": [{"pos": "adj", "definitions": ["Complete; downright; utter.", "Lower than nearby areas; low-lying.", "Existing in or sunk to a low condition, position, or state; contemptible, despicable, miserable.", "Of a person: cast down in hope or spirit; showing utter helplessness, hopelessness, or resignation; also, grovelling; ingratiating; servile.", "Marginalized as deviant."]}, {"pos": "noun", "definitions": ["A person in the lowest and most despicable condition; an oppressed person; an outcast; also, such people as a class."]}, {"pos": "verb", "definitions": ["To cast down (someone or something); to abase; to debase; to degrade; to lower; also, to forcibly impose obedience or servitude upon (someone); to subjugate.", "To cast off or out (someone or something); to reject, especially as contemptible or inferior.", "Of a fungus: to (forcibly) give off (spores or sporidia)."]}], "ipa": "/ˈæbd͡ʒɛkt/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/c/cb/En-uk-abject.ogg/En-uk-abject.ogg.mp3", "translations": ["abyecto"], "difficulty": 0, "categories": ["work", "health", "travel"], "syllable_count": 2}, {"word": "abjectly", "definitions": [{"pos": "adv", "definitions": ["In an abject fashion; with great shame; desperately."]}], "ipa": "/æbˈd͡ʒɛktli/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/d/de/En-us-abjectly.ogg/En-us-abjectly.ogg.mp3", "translations": ["abyectamente"], "difficulty": 1, "categories": ["work", "travel", "education"], "syllable_count": 3}, {"word": "abjure", "definitions": [{"pos": "verb", "definitions": ["To solemnly reject; to abandon forever.", "To swear an oath to leave a place forever.", "To recant or retract a heresy on oath.", "To cause (someone) to recant or retract (a heresy or some other opinion).", "To cause or compel (someone) to leave a place forever; to banish.", "To renounce (something) upon oath; to forswear; specifically, to recant or retract (a heresy or some other opinion); to withdraw.", "Especially in abjure the realm: to swear an oath to leave (a place) forever.", "To solemnly reject (someone or something); to abandon (someone or something) forever; to disavow, to disclaim, to repudiate."]}], "ipa": "/əbˈd͡ʒʊə/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/9/95/En-us-abjure.ogg/En-us-abjure.ogg.mp3", "translations": ["abjurar"], "difficulty": 1, "categories": ["work", "education", "travel"], "syllable_count": 3}, {"word": "ablation", "definitions": [{"pos": "noun", "definitions": ["The depletion of surface snow and ice from a spacecraft or meteorite through melting and evaporation caused by aerodynamic heating.", "The progressive removal of material by any of a variety of processes such as melting or vaporization under heat or chipping.", "The surgical removal of a body part, an organ, or especially a tumor; the removal of an organ function; amputation.", "The removal of a glacier by melting and evaporation; the lowering of a land surface by any of several means, as in wind erosion or mass wasting.", "A carrying or taking away; removal."]}], "ipa": "/əˈbleɪ.ʃn̩/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/2/20/En-us-ablation.ogg/En-us-ablation.ogg.mp3", "translations": ["ablación"], "difficulty": 1, "categories": ["work", "travel", "health"], "syllable_count": 3}, {"word": "ablative", "definitions": [{"pos": "adj", "definitions": ["Relating to the erosion of a land mass; relating to the melting or evaporation of a glacier.", "Applied to one of the cases of the noun in some languages, the fundamental meaning of the case being removal, separation, or taking away, and to a lesser degree, instrument, place, accordance, specifications, price, or measurement.", "Relating to the removal of a body part, tumor, or organ.", "Sacrificial, wearing away or being destroyed in order to protect the underlying material, as in ablative paints used for antifouling, or ablative heat shields used to protect spacecraft during reentry. .", "Pertaining to taking away or removing."]}, {"pos": "noun", "definitions": ["An ablative material.", "The ablative case."]}], "ipa": "/ˈæb.lə.tɪv/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/7/77/En-us-ablative.ogg/En-us-ablative.ogg.mp3", "translations": ["ablativo"], "difficulty": 1, "categories": ["work", "health", "education"], "syllable_count": 4}, {"word": "ablaut", "definitions": [{"pos": "noun", "definitions": ["The substitution of one root vowel for another, thus indicating a corresponding modification of use or meaning; vowel permutation, distinct from the phonetic influence of a succeeding vowel."]}, {"pos": "verb", "definitions": ["To cause to change a vowel.", "To undergo a change of vowel."]}], "ipa": "/ˈɑbˌlaʊt/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/8/8c/LL-Q1860_%28eng%29-Vealhurl-ablaut.wav/LL-Q1860_%28eng%29-Vealhurl-ablaut.wav.mp3", "translations": ["apofonía"], "difficulty": 0, "categories": ["work", "health", "travel"], "syllable_count": 2}, {"word": "ablaze", "definitions": [{"pos": "adj", "definitions": ["Burning fiercely; in a blaze; on fire.", "Radiant with bright light and color.", "In a state of glowing excitement, ardent desire, or other strong emotion."]}, {"pos": "adv", "definitions": ["Lit up brightly and with color, gleaming.", "In a state of glowing excitement or ardent desire.", "On fire; in a blaze."]}], "ipa": "/əˈbleɪz/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/8/8f/En-us-ablaze.ogg/En-us-ablaze.ogg.mp3", "translations": ["ardiendo", "en llamas"], "difficulty": 1, "categories": ["health", "travel", "work"], "syllable_count": 3}, {"word": "able", "definitions": [{"pos": "adj", "definitions": ["Free from constraints preventing completion of task; permitted to; not prevented from.", "Easy to use.", "Legally qualified or competent.", "Having the necessary powers or the needed resources to accomplish a task.", "Liable to.", "Rich; well-to-do.", "Suitable; competent.", "Capable of performing all the requisite duties; as an able seaman.", "Gifted with skill, intelligence, knowledge, or competence.", "Having the physical strength; robust; healthy."]}, {"pos": "verb", "definitions": ["To make capable; to enable.", "To dress.", "To make ready.", "To give power to; to reinforce; to confirm.", "To vouch for; to guarantee."]}, {"pos": "noun", "definitions": ["The letter \"A\" in Navy Phonetic Alphabet."]}], "ipa": "/ˈeɪbl̩/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/c/c2/En-us-able.ogg/En-us-able.ogg.mp3", "translations": ["capaz"], "difficulty": 0, "categories": ["education", "work", "travel"], "syllable_count": 2}, {"word": "ablution", "definitions": [{"pos": "noun", "definitions": ["The rinsing of the priest's hand and the sacred vessel following the Communion with, depending on rite, water or a mix of it and wine, which may then be drunk by the priest.", "The act of washing or cleansing the body, or some part of it, as a religious rite.", "Originally, the purifying of oils and other substances by emulsification with hot water; now more generally, a thorough cleansing of a precipitate or other non-dissolved substance.", "The act of washing something.", "wudu, ritual washing of the limbs and head performed immediately before prayer or holding the Quran", "Washing oneself; bathing, cleaning oneself up.", "The location or building where the showers and basins are located.", "The liquid used in the cleansing or ablution.", "The ritual consumption by the deacon or priest of leftover sacred wine of host after the Communion."]}], "ipa": "/əˈbluː.ʃn̩/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/4/40/En-us-ablution.ogg/En-us-ablution.ogg.mp3", "translations": ["ablución"], "difficulty": 1, "categories": ["work", "health", "travel"], "syllable_count": 3}, {"word": "ably", "definitions": [{"pos": "adv", "definitions": ["In an able manner; with great ability."]}], "ipa": "/ˈeɪ.bli/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/e/e6/LL-Q1860_%28eng%29-Vealhurl-ably.wav/LL-Q1860_%28eng%29-Vealhurl-ably.wav.mp3", "translations": ["hábilmente"], "difficulty": 0, "categories": ["education", "travel", "work"], "syllable_count": 2}, {"word": "abnegate", "definitions": [{"pos": "verb", "definitions": ["To deny (oneself something); to renounce or give up (a right, a power, a claim, a privilege, a convenience).", "To relinquish; to surrender; to abjure."]}], "ipa": "/ˈæb.nɪ.ɡeɪt/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/8/80/LL-Q1860_%28eng%29-Vealhurl-abnegate.wav/LL-Q1860_%28eng%29-Vealhurl-abnegate.wav.mp3", "translations": ["abnegar"], "difficulty": 2, "categories": ["work", "health", "travel"], "syllable_count": 4}, {"word": "abnegation", "definitions": [{"pos": "noun", "definitions": ["A denial; a renunciation; denial of desire or self-interest."]}], "ipa": "/ˌæbnɪˈɡeɪʃən/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/6/6f/LL-Q1860_%28eng%29-Vealhurl-abnegation.wav/LL-Q1860_%28eng%29-Vealhurl-abnegation.wav.mp3", "translations": ["abnegación"], "difficulty": 2, "categories": ["work", "health", "travel"], "syllable_count": 4}, {"word": "abnormal", "definitions": [{"pos": "adj", "definitions": ["Not conforming to rule or system; deviating from the usual or normal type.", "Of or pertaining to that which is irregular, in particular, behaviour that deviates from norms of social propriety or accepted standards of mental health."]}, {"pos": "noun", "definitions": ["A person or object that is not normal."]}], "ipa": "/ˈæbˌnɔɹ.ml̩/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/0/09/En-us-abnormal.ogg/En-us-abnormal.ogg.mp3", "translations": ["anormal"], "difficulty": 1, "categories": ["health", "work", "education"], "syllable_count": 3}, {"word": "abnormality", "definitions": [{"pos": "noun", "definitions": ["The state or quality of being abnormal; variation; irregularity.", "Something abnormal; an aberration; an abnormal occurrence or feature."]}], "ipa": "/ˌæbˌnɔɹˈmæl.ət.i/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/e/e0/LL-Q1860_%28eng%29-Vealhurl-abnormality.wav/LL-Q1860_%28eng%29-Vealhurl-abnormality.wav.mp3", "translations": ["anormalidad"], "difficulty": 2, "categories": ["health", "work", "travel"], "syllable_count": 5}, {"word": "abnormally", "definitions": [{"pos": "adv", "definitions": ["In an abnormal manner; in a way that deviates from a standard, norm, or average."]}], "ipa": "/æbˈnɔɹ.mə.li/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/5/54/LL-Q1860_%28eng%29-Vealhurl-abnormally.wav/LL-Q1860_%28eng%29-Vealhurl-abnormally.wav.mp3", "translations": ["anormalmente"], "difficulty": 1, "categories": ["work", "health", "education"], "syllable_count": 4}, {"word": "aboard", "definitions": [{"pos": "adv", "definitions": ["On board; into or within a ship or boat; hence, into or within a railway car.", "Alongside.", "Into a team, group, or company.", "On or onto a horse, a camel, etc.", "On base."]}, {"pos": "prep", "definitions": ["Onto a horse.", "On board of; onto or into a ship, boat, train, plane.", "Across; athwart; alongside."]}], "ipa": "/əˈbɔːd/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/2/25/En-us-aboard.ogg/En-us-aboard.ogg.mp3", "translations": ["a bordo", "a bordo de"], "difficulty": 0, "categories": ["travel", "work", "education"], "syllable_count": 2}, {"word": "abode", "definitions": [{"pos": "noun", "definitions": ["Stay or continuance in a place; sojourn.", "A residence, dwelling or habitation.", "Act of waiting; delay.", "An omen; a foretelling."]}, {"pos": "verb", "definitions": ["simple past and past participle of abide", "To bode; to foreshow; to presage.", "To be ominous."]}], "ipa": "/əˈbəʊd/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/f/f6/En-us-abode.ogg/En-us-abode.ogg.mp3", "translations": ["espera"], "difficulty": 1, "categories": ["work", "daily life", "education"], "syllable_count": 3}, {"word": "abolish", "definitions": [{"pos": "verb", "definitions": ["To put an end to or destroy, as a physical object; to wipe out.", "To end a law, system, institution, custom or practice."]}], "ipa": "/əˈbɒlɪʃ/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/a/ad/En-us-abolish.ogg/En-us-abolish.ogg.mp3", "translations": ["abolir"], "difficulty": 1, "categories": ["work", "health", "travel"], "syllable_count": 3}, {"word": "abolishment", "definitions": [{"pos": "noun", "definitions": ["The act of abolishing; abolition; destruction."]}], "ipa": "/əˈbɑl.ɪʃ.mənt/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/d/de/LL-Q1860_%28eng%29-PerfectSoundWhatever-abolishment.wav/LL-Q1860_%28eng%29-PerfectSoundWhatever-abolishment.wav.mp3", "translations": ["abolición"], "difficulty": 2, "categories": ["work", "health", "travel"], "syllable_count": 4}, {"word": "abolition", "definitions": [{"pos": "noun", "definitions": ["An amnesty; a putting out of memory.", "The state of being abolished.", "The act of abolishing; an annulling; abrogation.", "The ending of convict transportation.", "The ending of the slave trade or of slavery."]}], "ipa": "/ˌæb.əˈlɪʃ.n̩/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/8/86/EN-AU_ck1_abolition.ogg/EN-AU_ck1_abolition.ogg.mp3", "translations": ["abolición"], "difficulty": 1, "categories": ["work", "travel", "health"], "syllable_count": 4}, {"word": "abolitionism", "definitions": [{"pos": "noun", "definitions": ["Support for the abolition (banning) of sex work.", "Support for the abolition (banning) of abortion.", "Support for the abolition of something; the tenets of abolitionists.", "Support for the abolition of slavery.", "Support for the abolition of prisons."]}], "ipa": "/ˌæb.əˈlɪʃ.əˌnɪz.m̩/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/7/7e/LL-Q1860_%28eng%29-PerfectSoundWhatever-abolitionism.wav/LL-Q1860_%28eng%29-PerfectSoundWhatever-abolitionism.wav.mp3", "translations": ["abolicionismo"], "difficulty": 2, "categories": ["work", "health", "travel"], "syllable_count": 5}, {"word": "abolitionist", "definitions": [{"pos": "adj", "definitions": ["In favor of the abolition of slavery.", "In favor of the abolition of any particular institution or practice."]}, {"pos": "noun", "definitions": ["A person favoring or advocating for the abolition of any particular institution or practice.", "A person favoring or advocating for the abolition of slavery."]}], "ipa": "/ˌæ.bəˈlɪʃ.n̩.ɪst/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/5/5b/LL-Q1860_%28eng%29-Vealhurl-abolitionist.wav/LL-Q1860_%28eng%29-Vealhurl-abolitionist.wav.mp3", "translations": ["abolicionista", "abolicionista"], "difficulty": 2, "categories": ["health", "work", "travel"], "syllable_count": 5}, {"word": "abomasum", "definitions": [{"pos": "noun", "definitions": ["the lining of said compartment, considered as a foodstuff.", "The fourth digestive compartment of the stomach of a cow or other ruminant, after the omasum;\nthe lining of said compartment, considered as a foodstuff.", "The fourth digestive compartment of the stomach of a cow or other ruminant, after the omasum;"]}], "ipa": "/ˌæb.oʊˈmeɪ.səm/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/0/07/LL-Q1860_%28eng%29-Persent101-abomasum.wav/LL-Q1860_%28eng%29-Persent101-abomasum.wav.mp3", "translations": ["abomaso"], "difficulty": 2, "categories": ["health", "work", "education"], "syllable_count": 4}, {"word": "abominable", "definitions": [{"pos": "adj", "definitions": ["Excessive, large (used as an intensifier).", "Disagreeable or unpleasant.", "Very bad or inferior.", "Worthy of, or causing, abhorrence, as a thing of evil omen; odious in the utmost degree; very hateful; detestable; loathsome; execrable."]}], "ipa": "/əˈbɑm.ə.nə.bl̩/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/0/06/En-us-abominable.ogg/En-us-abominable.ogg.mp3", "translations": ["abominable"], "difficulty": 2, "categories": ["work", "health", "travel"], "syllable_count": 5}, {"word": "abominably", "definitions": [{"pos": "adv", "definitions": ["In an abominable manner; very odiously; detestably."]}], "ipa": "/əˈbɑm.ə.nə.bli/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/d/de/LL-Q1860_%28eng%29-Vealhurl-abominably.wav/LL-Q1860_%28eng%29-Vealhurl-abominably.wav.mp3", "translations": ["abominablemente"], "difficulty": 2, "categories": ["work", "health", "travel"], "syllable_count": 5}, {"word": "abominate", "definitions": [{"pos": "adj", "definitions": ["Abominable; detested."]}, {"pos": "verb", "definitions": ["To dislike strongly.", "To feel disgust towards; to loathe or detest thoroughly; to hate in the highest degree, as if with religious dread."]}], "ipa": "/əˈbɒm.əˌneɪt/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/a/a7/En-us-abominate.ogg/En-us-abominate.ogg.mp3", "translations": ["abominar"], "difficulty": 2, "categories": ["work", "travel", "health"], "syllable_count": 5}, {"word": "abomination", "definitions": [{"pos": "noun", "definitions": ["That which is abominable, shamefully vile; an object that excites disgust and hatred (often with religious undertones).", "A state that excites detestation or abhorrence; pollution.", "The feeling of extreme disgust and hatred", "An abominable act; a disgusting vice; a despicable habit."]}], "ipa": "/əˌbɒ.mɪˈneɪ.ʃən/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/9/93/LL-Q1860_%28eng%29-Vealhurl-abomination.wav/LL-Q1860_%28eng%29-Vealhurl-abomination.wav.mp3", "translations": ["abominación"], "difficulty": 2, "categories": ["travel", "work", "health"], "syllable_count": 5}, {"word": "aboriginal", "definitions": [{"pos": "adj", "definitions": ["First according to historical or scientific records; original; indigenous; primitive.", "Living in a land before colonization by the Europeans.", "Alternative letter-case form of Aboriginal"]}, {"pos": "noun", "definitions": ["An animal or plant native to a region.", "Alternative letter-case form of Aboriginal"]}], "ipa": "/ˌæb.əˈɹɪd͡ʒ.n̩.l̩/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/2/22/En-uk-aboriginal.ogg/En-uk-aboriginal.ogg.mp3", "translations": ["aborigen"], "difficulty": 2, "categories": ["work", "education", "travel"], "syllable_count": 5}, {"word": "abort", "definitions": [{"pos": "noun", "definitions": ["The product of a miscarriage; an aborted offspring; an abortion.", "An early termination of a mission, action, or procedure in relation to missiles or spacecraft; the craft making such a mission.", "An event in which a process is aborted.", "A miscarriage; an untimely birth; an abortion.", "The function used to abort a process."]}, {"pos": "verb", "definitions": ["To stop or fail at something in the preliminary stages.", "To terminate a process prior to completion.", "To become checked in normal development, so as either to remain rudimentary or shrink away wholly; to cease organic growth before maturation; to become sterile.", "To abandon a mission at any point after the beginning of the mission and prior to its completion.", "To end prematurely; to stop in the preliminary stages; to turn back.", "To miscarry; to bring forth (non-living) offspring prematurely.", "To cause an organism to develop minimally; to cause rudimentary development to happen; to prevent maturation.", "To terminate a mission involving a missile or rocket; to destroy a missile or rocket prematurely.", "To cause a premature termination of (a fetus); to end a pregnancy before term."]}], "ipa": "/əˈbɔːt/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/5/5d/En-us-abort.ogg/En-us-abort.ogg.mp3", "translations": ["aborto", "abortar"], "difficulty": 0, "categories": ["health", "travel", "work"], "syllable_count": 2}, {"word": "aborted", "definitions": [{"pos": "adj", "definitions": ["Rendered abortive or sterile; undeveloped.", "Stopped before completion; especially because of problems or danger.", "Checked in normal development at an early stage.", "Brought forth prematurely."]}, {"pos": "verb", "definitions": ["simple past and past participle of abort"]}], "ipa": "/əˈbɔɹtɪd/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/d/d9/LL-Q1860_%28eng%29-Vealhurl-aborted.wav/LL-Q1860_%28eng%29-Vealhurl-aborted.wav.mp3", "translations": ["abortado"], "difficulty": 1, "categories": ["work", "health", "travel"], "syllable_count": 3}, {"word": "abortifacient", "definitions": [{"pos": "adj", "definitions": ["Producing miscarriage."]}, {"pos": "noun", "definitions": ["A drug or an agent that induces an abortion."]}], "ipa": "/əˌbɔɹ.təˈfeɪ.ʃn̩t/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/e/ec/LL-Q1860_%28eng%29-Persent101-abortifacient.wav/LL-Q1860_%28eng%29-Persent101-abortifacient.wav.mp3", "translations": ["abortivo", "abortivo"], "difficulty": 2, "categories": ["health", "work", "travel"], "syllable_count": 5}, {"word": "abortion", "definitions": [{"pos": "noun", "definitions": ["The cessation of an illness or disease at a very early stage.", "A misshapen person or thing; a monstrosity.", "The expulsion from the womb of a foetus or embryo before it is fully developed, with loss of the foetus.", "An aborted foetus; an abortus.", "A spontaneous abortion; a miscarriage.", "Failure or abandonment of a project, promise, goal etc.", "Arrest of development of any organ, so that it remains an imperfect formation or is absorbed.", "An induced abortion."]}], "ipa": "/əˈbɔɹ.ʃn̩/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/a/ae/En-us-abortion.ogg/En-us-abortion.ogg.mp3", "translations": ["aborto"], "difficulty": 1, "categories": ["travel", "work", "health"], "syllable_count": 3}, {"word": "abortional", "definitions": [{"pos": "adj", "definitions": ["Pertaining to abortion; miscarrying; abortive."]}], "ipa": "/əˈbɔɹ.ʃn̩.l̩/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/7/72/LL-Q1860_%28eng%29-Persent101-abortional.wav/LL-Q1860_%28eng%29-Persent101-abortional.wav.mp3", "translations": ["abortivo"], "difficulty": 2, "categories": ["health", "work", "travel"], "syllable_count": 4}, {"word": "abortionist", "definitions": [{"pos": "noun", "definitions": ["A person who advocates for or supports the legality of abortion.", "A person who performs abortions, especially illegally or secretly."]}], "ipa": "/əˈbɔɹ.ʃə.nɪst/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/9/92/LL-Q1860_%28eng%29-Vealhurl-abortionist.wav/LL-Q1860_%28eng%29-Vealhurl-abortionist.wav.mp3", "translations": ["abortista"], "difficulty": 2, "categories": ["health", "work", "travel"], "syllable_count": 4}, {"word": "abortive", "definitions": [{"pos": "adj", "definitions": ["Coming to nothing; failing in its effect. .", "Made from the skin of a still-born animal.", "Having a short and mild progression, without pronounced symptoms.", "Cutting short; acting to halt or slow the progress (of a disease).", "Produced by abortion; born prematurely and therefore unnatural.", "Causing abortion; abortifacient.", "Imperfectly formed or developed; rudimentary; sterile."]}, {"pos": "noun", "definitions": ["A fruitless effort.", "A medicine that causes abortion, an abortifacient.", "Someone or something born or brought forth prematurely; an abortion.", "A medicine or treatment acting to halt or slow the progress of a disease."]}, {"pos": "verb", "definitions": ["To cause an abortion; to render without fruit."]}], "ipa": "/əˈbɔɹ.tɪv/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/a/a0/LL-Q1860_%28eng%29-M%C3%A9lange_a_trois-abortive.wav/LL-Q1860_%28eng%29-M%C3%A9lange_a_trois-abortive.wav.mp3", "translations": ["abortivo", "abortivo"], "difficulty": 1, "categories": ["work", "health", "travel"], "syllable_count": 4}, {"word": "abound", "definitions": [{"pos": "verb", "definitions": ["To be wealthy.", "To be present or available in large numbers or quantities; to be plentiful.", "To be full to overflowing; to bristle.", "To be copiously supplied.", "To revel in.", "To be highly productive."]}], "ipa": "/əˈbaʊnd/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/0/00/En-us-abound.ogg/En-us-abound.ogg.mp3", "translations": ["abundar"], "difficulty": 0, "categories": ["work", "education", "travel"], "syllable_count": 2}, {"word": "about", "definitions": [{"pos": "prep", "definitions": ["Concerning; with regard to; on account of; on the subject of; to affect.", "Concerned with; engaged in; intent on.", "See about to.", "Over or upon different parts of; through or over in various directions; here and there in; to and fro in; throughout.", "Within or in the immediate neighborhood of; in contiguity or proximity to; near, as to place.", "In a circle around; all round; on every side of; on the outside of.", "On one’s person; nearby the person.", "Indicates that something will happen very soon; indicates a plan or intention to do something.", "On the point or verge of.", "In or near, as in mental faculties or (literally) in the possession of; under the control of; at one's command; in one's makeup."]}, {"pos": "adv", "definitions": ["Nearly; approximately; with close correspondence in quality, manner, degree, quantity, or time; almost.", "To the opposite tack: see go about.", "In circuit; circularly; by a circuitous way; around the outside; in circumference.", "Here and there; around; in one place and another; up and down.", "From one place or position to another in succession; indicating repeated movement or activity.", "Near; in the vicinity.", "Indicating unproductive or unstructured activity.", "To a reversed order; half round; facing in the opposite direction; from a contrary point of view.", "In succession; one after another; in the course of events.", "On all sides; around."]}, {"pos": "adj", "definitions": ["Near; in the vicinity or neighbourhood.", "In existence; being in evidence; apparent.", "Moving around; astir."]}], "ipa": "/əˈbaʊt/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/e/ee/En-us-about.ogg/En-us-about.ogg.mp3", "translations": ["alrededor de", "alrededor"], "difficulty": 0, "categories": ["education", "work", "health"], "syllable_count": 2}, {"word": "above", "definitions": [{"pos": "prep", "definitions": ["Upstage of.", "In or to a higher place; higher than; on or over the upper surface.", "Higher in rank, status, or position.", "Farther north than.", "In addition to; besides.", "Physically over; on top of; worn on top of, said of clothing.", "Higher than; superior to in any respect; surpassing; higher in measure, degree, volume, or pitch, etc. than; out of reach; not exposed to; not likely to be affected by; incapable of negative actions or thoughts.", "Rising; appearing out of reach height-wise.", "Surpassing in number or quantity; more than.", "In preference to.", "Too proud to stoop to; averse to; disinclined towards;", "Beyond; on the other side."]}, {"pos": "adv", "definitions": ["Above zero; above freezing.", "On the upper half or the dorsal surface of an animal.", "More in number.", "In addition.", "Into or from heaven; in the sky.", "In a higher place; upstairs; farther upstream.", "Higher in rank, power, or position.", "Directly overhead; vertically on top of.", "Higher in the same page; earlier in the order as far as writing products go."]}, {"pos": "adj", "definitions": ["Being located higher on the same page or on a preceding page.", "Of heaven; heavenly."]}, {"pos": "noun", "definitions": ["betterment, raised status or condition.", "Heaven.", "Higher authority.", "Something, especially a person's name in legal documents, that appears higher on the same page or on a preceding page."]}], "ipa": "/əˈbʌv/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/b/b9/En-us-above.ogg/En-us-above.ogg.mp3", "translations": ["encima", "arriba"], "difficulty": 0, "categories": ["work", "education", "health"], "syllable_count": 3}, {"word": "above-mentioned", "definitions": [{"pos": "adj", "definitions": ["Mentioned or named before; aforesaid."]}], "ipa": "/əˈbʌvˌmɛnʃn̩d/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/1/1d/En-us-above-mentioned.ogg/En-us-above-mentioned.ogg.mp3", "translations": ["sobredicho"], "difficulty": 2, "categories": ["education", "health", "work"], "syllable_count": 6}, {"word": "abracadabra", "definitions": [{"pos": "noun", "definitions": ["A use of the mystical term ‘abracadabra’, supposed to work as part of a healing charm or a magical spell; any spell or incantation making use of the word.", "Mumbo jumbo; obscure language or technicalities; jargon."]}, {"pos": "intj", "definitions": ["Used to indicate that a magic trick or other illusion has been performed."]}], "ipa": "/ˌæbɹəkəˈdæbɹə/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/b/b0/En-us-abracadabra.ogg/En-us-abracadabra.ogg.mp3", "translations": ["abracadabra"], "difficulty": 2, "categories": ["health", "travel", "work"], "syllable_count": 5}, {"word": "abrade", "definitions": [{"pos": "verb", "definitions": ["To cause the surface to become more rough.", "To wear down or exhaust, as a person; irritate.", "To rub or wear off; erode.", "To undergo abrasion.", "To irritate by rubbing; chafe.", "Obsolete spelling of abraid."]}], "ipa": "/əˈbɹeɪd/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/5/55/LL-Q1860_%28eng%29-Vealhurl-abrade.wav/LL-Q1860_%28eng%29-Vealhurl-abrade.wav.mp3", "translations": ["escoriar"], "difficulty": 1, "categories": ["work", "education", "travel"], "syllable_count": 3}, {"word": "Abrahamic", "definitions": [{"pos": "adj", "definitions": ["Pertaining to Abraham, the patriarch.", "Descended from the religious tradition of Abraham."]}, {"pos": "noun", "definitions": ["A member of an Abrahamic religion (usually Christians and Muslims, and also Jews)."]}], "ipa": "/eɪ.bɹəˈhæm.ɪk/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/8/82/En-us-Abrahamic.ogg/En-us-Abrahamic.ogg.mp3", "translations": ["abrahámico"], "difficulty": 2, "categories": ["health", "work", "travel"], "syllable_count": 4}, {"word": "abrasion", "definitions": [{"pos": "noun", "definitions": ["The wearing away of the surface of the tooth by chewing.", "The substance thus rubbed off; debris.", "The act of abrading, wearing, or rubbing off; the wearing away by friction.", "An abraded, scraped, or worn area.", "The effect of mechanical erosion of rock, especially a river bed, by rock fragments scratching and scraping it.", "A superficial wound caused by scraping; an area of skin where the cells on the surface have been scraped or worn away."]}], "ipa": "/əˈbɹeɪ.ʒn̩/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/e/eb/En-us-abrasion.ogg/En-us-abrasion.ogg.mp3", "translations": ["abrasión"], "difficulty": 1, "categories": ["health", "work", "travel"], "syllable_count": 3}, {"word": "abrasive", "definitions": [{"pos": "adj", "definitions": ["Producing abrasion; rough enough to wear away the outer surface.", "Being rough and coarse in manner or disposition; overly aggressive and causing irritation."]}, {"pos": "noun", "definitions": ["A hard inorganic substance or material consisting in powder or granule form such as sandpaper, pumice, or emery, used for cleaning, smoothing, or polishing.", "Rock fragments, sand grains, mineral particles, used by water, wind, and ice to abrade a land surface."]}], "ipa": "/əˈbɹeɪ.sɪv/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/f/f9/LL-Q1860_%28eng%29-Vealhurl-abrasive.wav/LL-Q1860_%28eng%29-Vealhurl-abrasive.wav.mp3", "translations": ["abrasivo", "abrasivo"], "difficulty": 1, "categories": ["work", "travel", "health"], "syllable_count": 4}, {"word": "abreast", "definitions": [{"pos": "adv", "definitions": ["Side by side and facing forward.", "At the same time; simultaneously.", "Informed, well-informed, familiar, acquainted.", "Breast high (of an advancing wave).", "Alongside; parallel to.", "Side by side; also, opposite; on a line with the vessel's beam.", "Followed by of or with: up to a certain level or line; equally advanced."]}, {"pos": "adj", "definitions": ["Side by side; also, opposite; over against; on a line with the vessel's beam.", "Informed, well-informed, familiar, acquainted.", "Alongside; parallel to.", "Up to a certain level or line; equally advanced", "Side by side, facing forward."]}, {"pos": "prep", "definitions": ["Abreast of; alongside."]}], "ipa": "/əˈbɹɛst/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/a/ab/En-us-abreast.ogg/En-us-abreast.ogg.mp3", "translations": ["de lado a lado"], "difficulty": 0, "categories": ["travel", "health", "work"], "syllable_count": 2}, {"word": "abridge", "definitions": [{"pos": "verb", "definitions": ["To debar from.", "To curtail.", "To make shorter; to shorten in duration or extent.", "To deprive; to cut off.", "Cut short; truncate.", "To shorten or contract by using fewer words, yet retaining the sense; to epitomize; to condense."]}], "ipa": "/əˈbɹɪd͡ʒ/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/9/9a/En-us-abridge.ogg/En-us-abridge.ogg.mp3", "translations": ["abreviar"], "difficulty": 1, "categories": ["work", "travel", "health"], "syllable_count": 3}, {"word": "abridgment", "definitions": [{"pos": "noun", "definitions": ["An epitome or compend, as of a book; a shortened or abridged form; an abbreviation.", "The act of abridging; reduction or deprivation", "That which abridges or cuts short; hence, an entertainment that makes the time pass quickly", "The leaving out of certain portions of a plaintiff's demand, the writ still holding good for the remainder.", "The state of being abridged or lessened.", "Any of various brief statements of case law made before modern reporting of legal cases."]}], "ipa": "/əˈbɹɪd͡ʒ.mənt/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/2/2f/LL-Q1860_%28eng%29-Vealhurl-abridgment.wav/LL-Q1860_%28eng%29-Vealhurl-abridgment.wav.mp3", "translations": ["compendio"], "difficulty": 1, "categories": ["travel", "work", "health"], "syllable_count": 3}, {"word": "abroad", "definitions": [{"pos": "adv", "definitions": ["Without a certain confine; outside the house; away from one's abode.", "At large; widely; broadly; over a wide space.", "Beyond the bounds of a country; in foreign countries.", "Not on target; astray; in error; confused; dazed.", "Played elsewhere than one's home grounds.", "Before the public at large; throughout society or the world; here and there; moving without restriction."]}, {"pos": "noun", "definitions": ["Countries or lands abroad."]}, {"pos": "prep", "definitions": ["Throughout, over."]}, {"pos": "adj", "definitions": ["International."]}], "ipa": "/əˈbɹɔːd/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/a/a5/En-us-abroad.ogg/En-us-abroad.ogg.mp3", "translations": ["en el extranjero", "el extranjero"], "difficulty": 0, "categories": ["travel", "education", "work"], "syllable_count": 2}, {"word": "abrogable", "definitions": [{"pos": "adj", "definitions": ["capable of being abrogated."]}], "ipa": "/ˈæb.ɹə.ɡə.bl̩/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/0/02/LL-Q1860_%28eng%29-Persent101-abrogable.wav/LL-Q1860_%28eng%29-Persent101-abrogable.wav.mp3", "translations": ["abrogable"], "difficulty": 2, "categories": ["health", "work", "education"], "syllable_count": 4}, {"word": "abrogate", "definitions": [{"pos": "verb", "definitions": ["To block a process or function.", "To put an end to; to do away with.", "To annul by an authoritative act; to abolish by the authority of the maker or their successor; to repeal; — applied to the repeal of laws, decrees, ordinances, the abolition of customs, etc."]}, {"pos": "adj", "definitions": ["Abrogated; abolished."]}], "ipa": "/ˈæ.bɹə.ɡət/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/b/b6/LL-Q1860_%28eng%29-Vealhurl-abrogate_%28adj%29.wav/LL-Q1860_%28eng%29-Vealhurl-abrogate_%28adj%29.wav.mp3", "translations": ["abrogar"], "difficulty": 1, "categories": ["travel", "work", "health"], "syllable_count": 4}, {"word": "abrogation", "definitions": [{"pos": "noun", "definitions": ["The act of abrogating.", "The blocking of a molecular process or function.", "A repeal by authority; abolition."]}], "ipa": "/ˌæb.ɹəˈɡeɪ.ʃən/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/8/86/LL-Q1860_%28eng%29-Vealhurl-abrogation.wav/LL-Q1860_%28eng%29-Vealhurl-abrogation.wav.mp3", "translations": ["abrogación"], "difficulty": 2, "categories": ["work", "travel", "health"], "syllable_count": 4}, {"word": "abrupt", "definitions": [{"pos": "adj", "definitions": ["Without notice to prepare the mind for the event; sudden; hasty; unceremonious.", "Having sudden transitions from one subject or state to another; unconnected; disjointed.", "Extremely steep or craggy as if broken up; precipitous.", "Broken off.", "Broken away (from restraint).", "Curt in manner.", "Suddenly terminating, as if cut off; truncate."]}, {"pos": "verb", "definitions": ["To interrupt suddenly.", "To tear off or asunder."]}, {"pos": "noun", "definitions": ["Something which is abrupt; an abyss."]}], "ipa": "/əˈbɹʌpt/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/0/0f/En-us-abrupt.ogg/En-us-abrupt.ogg.mp3", "translations": ["abrupto"], "difficulty": 0, "categories": ["work", "travel", "health"], "syllable_count": 2}, {"word": "abruptly", "definitions": [{"pos": "adv", "definitions": ["In an abrupt manner; without giving notice, or without the usual forms; suddenly; precipitously."]}], "ipa": "/əˈbɹʌp.li/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/2/21/En-us-abruptly.ogg/En-us-abruptly.ogg.mp3", "translations": ["abruptamente"], "difficulty": 1, "categories": ["work", "travel", "education"], "syllable_count": 3}, {"word": "abscess", "definitions": [{"pos": "noun", "definitions": ["A cavity caused by tissue destruction, usually because of infection, filled with pus and surrounded by inflamed tissue."]}, {"pos": "verb", "definitions": ["To form a pus-filled cavity, typically from an infection."]}], "ipa": "/ˈæbsɛs/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/1/15/En-uk-abscess.ogg/En-uk-abscess.ogg.mp3", "translations": ["absceso", "absceder"], "difficulty": 0, "categories": ["travel", "health", "work"], "syllable_count": 2}, {"word": "abscissa", "definitions": [{"pos": "noun", "definitions": ["The first of the two terms by which a point is referred to, in a system of fixed rectilinear coordinate (Cartesian coordinate) axes.", "The horizontal line representing an axis of a Cartesian coordinate system, on which the abscissa (sense above) is shown."]}], "ipa": "/æbˈsɪs.ə/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/e/e2/En-us-abscissa.ogg/En-us-abscissa.ogg.mp3", "translations": ["abscisa"], "difficulty": 1, "categories": ["education", "work", "health"], "syllable_count": 3}, {"word": "Traditional Chinese", "definitions": [{"pos": "name", "definitions": ["Chinese written using the traditional form of Chinese characters, as opposed to Simplified Chinese (introduced by the PRC as script reform)."]}], "ipa": "/tɹəˈdɪʃənəl tʃaɪˈniːz/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/a/a3/LL-Q1860_%28eng%29-PerfectSoundWhatever-Traditional_Chinese.wav/LL-Q1860_%28eng%29-PerfectSoundWhatever-Traditional_Chinese.wav.mp3", "translations": ["chino tradicional"], "difficulty": 2, "categories": ["education", "work", "health"], "syllable_count": 7}, {"word": "on", "definitions": [{"pos": "adj", "definitions": ["Fitted; covering or being worn.", "In the state of being active, functioning or operating.", "Acting in character.", "Of a stated part of something, oriented towards the viewer or other specified direction.", "Of a person, used to express agreement to or acceptance of a proposal or challenge made by that person; most commonly with subject \"you\" (see you're on).", "Menstruating.", "Available; remaining.", "Acceptable, appropriate.", "Having reached a base as a runner and being positioned there, awaiting further action from a subsequent batter.", "Of a ball, being the next in sequence to be potted, according to the rules of the game.", "Within the half of the field on the same side as the batsman's legs; the left side for a right-handed batsman.", "Possible; capable of being successfully carried out.", "Happening; taking place; being or due to be put into action.", "Performative or funny in a wearying manner."]}, {"pos": "adv", "definitions": ["To an operating state.", "Later.", "In continuation, at length.", "Along, forwards (continuing an action), onwards.", "So as to cover or be fitted.", "Of a ball, into a pottable position.", "Of betting odds, denoting a better-than-even chance. See also odds-on."]}, {"pos": "prep", "definitions": ["In a position of being able to pot (a given ball).", "In addition to; besides; indicating multiplication or succession in a series.", "Positioned at the upper surface of, touching from above.", "Regularly taking (a drug).", "Serving as a member of.", "To the account or detriment of; denoting imprecation or invocation, or coming to, falling, or resting upon.", "Denoting performance or action by contact with the surface, upper part, or outside of anything; hence, by means of; with.", "With verbs describing an action of pushing, pulling, pressing, etc., designates the thing to which force is applied.", "Against; in opposition to.", "Indicating a means or medium.", "At the peril of, or for the safety of.", "In the possession of.", "Indicating a means of subsistence or sustenance.", "By virtue of; with the pledge of.", "Dealing with the subject of; about; concerning.", "Denoting physical contact or interaction with an object, such as impact or application of force.", "At (a certain value or level).", "Toward; for; indicating the object of an emotion.", "According to, from the standpoint of; expressing what must follow, whether accepted or not, if a given premise or system is assumed true.", "Indicating the target of, or thing affected by, an event or action.", "At the time of (and often because of).", "Aboard (a mode of transport, especially public transport, or transport that one sits astride or uses while standing).", "Under the influence of (a drug, or something that is causing drug-like effects).", "At or during the date or day of.", "Of.", "At (a relative spatial position).", "Generated by.", "Having Vⁿ as domain and V as codomain, for the specified set V and some integer n.", "Positioned at or resting against the outer surface of; attached to.", "Because of; due to; upon the basis of (something not yet confirmed as true).", "Covering.", "Near; adjacent to; alongside; just off.", "At (an instant or cusp).", "Indicating dependence or reliance.", "Ellipsis of I swear on: on my life, on God, on everything, etc.", "Indicating position or location.", "At (a certain position within a sequence).", "Engaged in or occupied with (an action or activity).", "Having as identical domain and codomain.", "With verbs describing an action of hitting, rubbing, scratching, binding against, etc., designates the thing impacted or contacted.", "Supported by (the specified part of itself).", "Divided by.", "Arrived or coming into the presence of.", "Paid for by.", "Indicating the person experiencing an emotion, cold, thirst, hunger, etc.", "At (a given time after the start of something).", "At or in (a geographical location or position).", "Expressing figurative placement, burden, or attachment.", "Without."]}, {"pos": "verb", "definitions": ["To switch on."]}, {"pos": "noun", "definitions": ["In the Japanese language, a pronunciation, or reading, of a kanji character that was originally based on the character's pronunciation in Chinese, contrasted with kun."]}], "ipa": "/ɒn/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/f/fe/LL-Q1860_%28eng%29-Back_ache-on.wav/LL-Q1860_%28eng%29-Back_ache-on.wav.mp3", "translations": ["encendido", "en"], "difficulty": 0, "categories": ["education", "travel", "work"], "syllable_count": 1}, {"word": "abscission", "definitions": [{"pos": "noun", "definitions": ["A figure of speech employed when a speaker having begun to say a thing stops abruptly", "The state of being cut off.", "The act or process of cutting off.", "The natural separation of a part at a predetermined location, such as a leaf at the base of the petiole."]}], "ipa": "/æbˈsɪ.ʃn̩/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/5/55/LL-Q1860_%28eng%29-Vealhurl-abscission.wav/LL-Q1860_%28eng%29-Vealhurl-abscission.wav.mp3", "translations": ["abscisión"], "difficulty": 1, "categories": ["work", "travel", "health"], "syllable_count": 3}, {"word": "abscond", "definitions": [{"pos": "verb", "definitions": ["To evade, to hide or flee from.", "To hide, conceal, or absent oneself clandestinely, with the intent to avoid legal process", "To flee, often secretly; to steal away.", "To conceal; to take away.", "To abandon a hive.", "To hide, to be in hiding or concealment."]}], "ipa": "/əbˈskɒnd/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/7/76/LL-Q1860_%28eng%29-Vealhurl-abscond.wav/LL-Q1860_%28eng%29-Vealhurl-abscond.wav.mp3", "translations": ["fugarse"], "difficulty": 1, "categories": ["travel", "work", "health"], "syllable_count": 2}, {"word": "odd", "definitions": [{"pos": "adj", "definitions": ["Scattered; occasional, infrequent; not forming part of a set or pattern.", "Out of the way, secluded.", "Peculiar, singular and strange in looks or character; eccentric, bizarre.", "Not regular or planned.", "Used or employed for odd jobs.", "Numerically indivisible by two.", "About, approximately; somewhat more than (an approximated round number).", "Left over or remaining (as a small amount) after counting, payment, etc.", "Singular in excellence; matchless; peerless; outstanding.", "On the left.", "Differing from what is usual, ordinary or expected.", "Numbered with an odd number.", "Left over, remaining after the rest have been paired or grouped.", "Without a corresponding mate in a pair or set; unmatched; (of a pair or set) mismatched."]}, {"pos": "noun", "definitions": ["An odd number.", "Something left over, not forming part of a set."]}], "ipa": "/ɒd/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/0/0c/En-us-odd.ogg/En-us-odd.ogg.mp3", "translations": ["guacho"], "difficulty": 0, "categories": ["work", "travel", "education"], "syllable_count": 1}, {"word": "quiz", "definitions": [{"pos": "noun", "definitions": ["An odd, puzzling or absurd person or thing.", "One who questions or interrogates; a prying person.", "A school examination of less importance, or of greater brevity, than others given in the same course.", "A competition in the answering of questions."]}, {"pos": "verb", "definitions": ["To peer at; to eye suspiciously or mockingly.", "To play with a quiz.", "To hoax; to chaff or mock with pretended seriousness of discourse; to make sport of, as by obscure questions.", "To instruct (someone) by means of a quiz.", "To question (someone) closely, to interrogate."]}], "ipa": "/kwɪz/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/8/8e/En-us-quiz.ogg/En-us-quiz.ogg.mp3", "translations": ["prueba", "engañar"], "difficulty": 0, "categories": ["education", "work", "travel"], "syllable_count": 1}, {"word": "calendar", "definitions": [{"pos": "noun", "definitions": ["A means to determine the date consisting of a document containing dates and other temporal information.", "A list of planned events.", "Any system by which time is divided into days, weeks, months, and years.", "An orderly list or enumeration of persons, things, or events; a schedule.", "An appointment book (US), appointment diary (UK)"]}, {"pos": "verb", "definitions": ["To enter or write in a calendar; to register.", "To set a date for a proceeding in court, usually done by a judge at a calendar call."]}], "ipa": "/ˈkæl.ən.də/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/1/16/En-us-calendar.ogg/En-us-calendar.ogg.mp3", "translations": ["calendario", "calendarizar"], "difficulty": 1, "categories": ["travel", "health", "education"], "syllable_count": 3}, {"word": "millennium", "definitions": [{"pos": "noun", "definitions": ["The year in which one period of one thousand years ends and another begins, especially the year 2000.", "A period of time consisting of one thousand years.", "A period of universal happiness, peace or prosperity; a utopia.", "The period of one thousand years during which Christ will reign on earth (according to Millenarianist interpretations)."]}], "ipa": "/mɪˈlɛnɪəm/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/3/35/En-uk-millennium.oga/En-uk-millennium.oga.mp3", "translations": ["milenio"], "difficulty": 1, "categories": ["education", "travel", "work"], "syllable_count": 3}, {"word": "week", "definitions": [{"pos": "noun", "definitions": ["A date seven days after (sometimes before) the specified day.", "A subdivision of the month into longer periods of work days punctuated by shorter weekend periods of days for markets, rest, or religious observation such as a sabbath.", "A period of seven days beginning with Sunday or Monday.", "Any period of seven consecutive days.", "A period of five days beginning with Monday."]}, {"pos": "intj", "definitions": ["The squeal of a pig."]}], "ipa": "/wik/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/c/cf/En-us-week.ogg/En-us-week.ogg.mp3", "translations": ["semana"], "difficulty": 0, "categories": ["travel", "education", "work"], "syllable_count": 1}, {"word": "abashed", "definitions": [{"pos": "adj", "definitions": ["Embarrassed, disconcerted, or ashamed."]}, {"pos": "verb", "definitions": ["simple past and past participle of abash"]}], "ipa": "/əˈbæʃt/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/7/73/LL-Q1860_%28eng%29-Wodencafe-abashed.wav/LL-Q1860_%28eng%29-Wodencafe-abashed.wav.mp3", "translations": ["avergonzado"], "difficulty": 1, "categories": ["work", "travel", "health"], "syllable_count": 3}, {"word": "leap", "definitions": [{"pos": "verb", "definitions": ["To copulate with (a human)", "To jump.", "To copulate with (a female beast)", "To pass over by a leap or jump.", "To cause to leap."]}, {"pos": "noun", "definitions": ["A fault.", "A passing from one note to another by an interval, especially by a long one, or by one including several other intermediate intervals.", "Copulation with, or coverture of, a female beast.", "The act of leaping or jumping.", "A large step in reasoning, often one that is not justified by the facts.", "The distance traversed by a leap or jump.", "A significant move forward.", "A small cataract over which fish attempt to jump; a salmon ladder.", "A group of leopards.", "A trap or snare for fish, made from twigs; a weely.", "Half a bushel."]}, {"pos": "adj", "definitions": ["Intercalary, bissextile."]}], "ipa": "/liːp/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/0/07/En-us-leap.ogg/En-us-leap.ogg.mp3", "translations": ["saltar", "salto"], "difficulty": 0, "categories": ["travel", "health", "education"], "syllable_count": 1}, {"word": "nu", "definitions": [{"pos": "noun", "definitions": ["The letter of the Greek alphabet Ν (N) and ν (n).", "A measure of constringence in lenses or prisms."]}, {"pos": "intj", "definitions": ["An exclamation of surprise, emphasis, doubt, etc.", "Well? (Used as a question to demand an answer from someone reluctant to answer.)"]}, {"pos": "adj", "definitions": ["new"]}], "ipa": "/njuː/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/2/2b/En-us-nu.ogg/En-us-nu.ogg.mp3", "translations": ["ni"], "difficulty": 0, "categories": ["education", "travel", "health"], "syllable_count": 1}, {"word": "watchlist", "definitions": [{"pos": "noun", "definitions": ["A list of people or things that are assigned to receive special attention or monitoring."]}, {"pos": "verb", "definitions": ["To add to a watchlist."]}], "ipa": "/ˈwɔt͡ʃˌlɪst/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/3/3d/En-us-watchlist.ogg/En-us-watchlist.ogg.mp3", "translations": ["lista de seguimiento"], "difficulty": 0, "categories": ["health", "education", "travel"], "syllable_count": 2}, {"word": "winter", "definitions": [{"pos": "noun", "definitions": ["Someone with dark skin, eyes and hair, seen as best suited to certain colors of clothing.", "The rainy season.", "An appliance to be fixed on the front of a grate, to keep a kettle warm, etc.", "Traditionally the fourth of the four seasons, typically regarded as being from December to February in continental regions of the Northern Hemisphere or the months of June, July, and August in the Southern Hemisphere. It is the time when the sun is lowest in the sky, resulting in short days, and the time of year with the lowest atmospheric temperatures for the region.", "The period of decay, old age, death, or the like."]}, {"pos": "verb", "definitions": ["To store something (for instance animals) somewhere over winter to protect it from cold.", "To spend the winter (in a particular place)."]}], "ipa": "/ˈwɪntə/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/d/d4/En-us-winter.ogg/En-us-winter.ogg.mp3", "translations": ["invierno", "invernar"], "difficulty": 0, "categories": ["work", "education", "travel"], "syllable_count": 2}, {"word": "bone", "definitions": [{"pos": "noun", "definitions": ["The wishbone formation.", "One of the fragments of bone held between the fingers of the hand and rattled together to keep time to music.", "A domino or die.", "A bonefish.", "A bone of a fish; a fishbone.", "An erect penis; a boner.", "A dollar.", "A cannabis cigarette; a joint.", "A reward.", "One of the rigid parts of a corset that forms its frame, the boning, originally made of whalebone.", "The framework of anything.", "Anything made of bone, such as a bobbin for weaving bone lace.", "Any of the components of an endoskeleton, made of bone.", "A composite material consisting largely of calcium phosphate and collagen and making up the skeleton of most vertebrates.", "An off-white colour, like the colour of bone.", "Clipping of trombone."]}, {"pos": "adj", "definitions": ["Of an off-white colour, like the colour of bone."]}, {"pos": "verb", "definitions": ["To fertilize with bone.", "To nag, especially for an unpaid debt.", "To perform “bone pointing”, a ritual that is intended to bring illness or even death to the victim.", "To prepare (meat, etc) by removing the bone or bones from.", "To make level, using a particular procedure; to survey a level line.", "To put whalebone into.", "To have sexual intercourse (with).", "To study.", "To polish boots to a shiny finish.", "To apprehend, steal.", "To sight along an object or set of objects to check whether they are level or in line."]}, {"pos": "adv", "definitions": ["Used before an adjective as an intensifier"]}], "ipa": "/bəʊn/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/2/2e/En-us-bone.ogg/En-us-bone.ogg.mp3", "translations": ["hueso", "osiforme", "deshuesar"], "difficulty": 0, "categories": ["travel", "education", "work"], "syllable_count": 1}, {"word": "servant", "definitions": [{"pos": "noun", "definitions": ["A person of low condition or spirit.", "A professed lover.", "One who is hired to perform regular household or other duties, and receives compensation. As opposed to a slave.", "One who serves another, providing help in some manner.", "A person who dedicates themselves to God."]}, {"pos": "verb", "definitions": ["To subject."]}], "ipa": "/ˈsɜːvənt/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/a/a5/En-us-servant.ogg/En-us-servant.ogg.mp3", "translations": ["sirviente"], "difficulty": 0, "categories": ["work", "education", "travel"], "syllable_count": 2}, {"word": "robot", "definitions": [{"pos": "noun", "definitions": ["A system of serfdom used in Central Europe, under which a tenant's rent was paid in forced labour.", "A person who does not seem to have any emotions or individuality.", "A machine built to carry out some complex task or group of tasks by physically moving, especially one which can be programmed.", "A traffic light (from earlier robot policeman).", "An intelligent mechanical being designed to look like a human or other creature, and usually made from metal.", "A style of dance popular in disco in which the dancer imitates the stiff movements of a stereotypical android robot.", "A theodolite which follows the movements of a prism and can be used by a one-man crew.", "A habitual poster on the /r9k/ board on 4chan; a member of the /r9k/ community."]}], "ipa": "/ˈɹəʊ.bɒt/", "mp3_url": "https://upload.wikimedia.org/wikipedia/commons/transcoded/3/3a/En-us-robot.ogg/En-us-robot.ogg.mp3", "translations": ["robot"], "difficulty": 0, "categories": ["work", "health", "travel"], "syllable_count": 2}]
